#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.ГруппаБизнесПроцессы.Доступность = НаборКонстант.ИспользоватьБизнесПроцессыИЗадачи;
	
	ЭтоФайловаяБаза = ОбщегоНазначения.ИнформационнаяБазаФайловая();
	
	Элементы.ИспользоватьФоновыйСтартПроцессов.Видимость = Не ЭтоФайловаяБаза;
	
	ВидимостьНастройкиФоновогоВыполненияЗадач = Ложь;
	ДоступностьНастройкиФоновогоВыполненияЗадач = Ложь;
	Если НаборКонстант.ИспользоватьСинхронизациюДанных Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ ПЕРВЫЕ 2
			| Полный.Ссылка
			|ИЗ
			| ПланОбмена.Полный КАК Полный
			|ГДЕ
			| Полный.ПометкаУдаления = ЛОЖЬ";
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		ИспользуетсяПолныйПланОбмена = (Выборка.Количество() = 2);
		
		Если ИспользуетсяПолныйПланОбмена Тогда
			ВидимостьНастройкиФоновогоВыполненияЗадач = Истина;
			ДоступностьНастройкиФоновогоВыполненияЗадач = Ложь;
		Иначе
			ВидимостьНастройкиФоновогоВыполненияЗадач = Не ЭтоФайловаяБаза;
			ДоступностьНастройкиФоновогоВыполненияЗадач = Истина
		КонецЕсли;
		
	КонецЕсли;
	Элементы.ИспользоватьФоновоеВыполнениеЗадач.Видимость = ВидимостьНастройкиФоновогоВыполненияЗадач;
	Элементы.ИспользоватьФоновоеВыполнениеЗадач.Доступность = ДоступностьНастройкиФоновогоВыполненияЗадач;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// Приглашение на мероприятие
	ТекущийОбъект.ИспользоватьПриглашениеНаМероприятие =
		ТекущийОбъект.ИспользоватьБизнесПроцессыИЗадачи И 
		ТекущийОбъект.ИспользоватьУправлениеМероприятиями;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ТекущийОбъект.ИспользоватьГрафикиРаботы И ЗначениеЗаполнено(ТекущийОбъект.ОсновнойГрафикРаботы) Тогда 
			
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Проекты.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Проекты КАК Проекты
		|ГДЕ
		|	Проекты.ГрафикРаботы = ЗНАЧЕНИЕ(Справочник.ГрафикиРаботы.ПустаяСсылка)";
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			ПроектОбъект = Выборка.Ссылка.ПолучитьОбъект();
			ПроектОбъект.ГрафикРаботы = ТекущийОбъект.ОсновнойГрафикРаботы;
			ПроектОбъект.ОбменДанными.Загрузка = Истина;
			ПроектОбъект.Записать();
		КонецЦикла;
			
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ОбновитьПовторноИспользуемыеЗначения();
	ОбновитьИнтерфейс();
	
	Если ПараметрыЗаписи.Свойство("Закрыть") Тогда
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ИспользоватьБизнесПроцессыИЗадачиПриИзменении(Элемент)
	
	Элементы.ГруппаБизнесПроцессы.Доступность = НаборКонстант.ИспользоватьБизнесПроцессыИЗадачи;
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьГрафикиРаботыПриИзменении(Элемент)
	
	СохранитьКонстантуИспользоватьГрафикиРаботы(НаборКонстант.ИспользоватьГрафикиРаботы);
	ОбновитьИнтерфейс();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура КомандаЗаписатьИЗакрыть(Команда)
	
	ПараметрыЗаписи = Новый Структура;
	ПараметрыЗаписи.Вставить("Закрыть", Истина);
	Записать(ПараметрыЗаписи);
	
КонецПроцедуры

&НаСервере
Процедура СохранитьКонстантуИспользоватьГрафикиРаботы(ИспользоватьГрафикиРаботы)
	
	Константы.ИспользоватьГрафикиРаботы.Установить(ИспользоватьГрафикиРаботы);
	
КонецПроцедуры

#КонецОбласти
