
&НаКлиенте
Процедура НастройкиПоУмолчанию(Команда)
	
	ВосстановитьНастройкиНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ВосстановитьНастройкиНаСервере()
	
	Объект.ВидПроекта = Справочники.ВидыПроектов.НайтиПоНаименованию("Проекты");
	Объект.ДлительностьДней = 1;
	Объект.ИдОрганизации = "3325382";
	Объект.Папка = Справочники.ПапкиПроектов.НайтиПоНаименованию("Проекты в работе");
	Объект.Подразделение = Справочники.СтруктураПредприятия.НайтиПоНаименованию("ГАПУУ");
	Объект.Руководитель = Справочники.Пользователи.НайтиПоНаименованию("Иванов Константин Владиславович");
	Объект.Токен = "AgAAAAA1wK4OAAXk8lr7vrH8pki-qa6ZFyvdgWM";
	Объект.Устройство = "111111";	

КонецПроцедуры

