
Процедура НапоминаниеОбОтчетахСотрудников() Экспорт
	
	Учетка = Справочники.УчетныеЗаписиЭлектроннойПочты.НайтиПоНаименованию("kovivanov@1cbit.ru");
	Если Не ЗначениеЗаполнено(Учетка) Тогда
		Возврат;
	КонецЕсли;
	ТД = ТекущаяДата();
	ПараметрыПисьма = Новый Структура;
	ПараметрыПисьма.Вставить("Тема", "Ежедневный отчет за " + Формат(ТД, "ДЛФ=D"));
	ГруппаПользователей = Справочники.РабочиеГруппы.НайтиПоНаименованию("Напоминания о ежедневных отчетах");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РабочиеГруппыСостав.Пользователь КАК Пользователь
	|ПОМЕСТИТЬ ПроектныйОтдел
	|ИЗ
	|	Справочник.РабочиеГруппы.Состав КАК РабочиеГруппыСостав
	|ГДЕ
	|	РабочиеГруппыСостав.Ссылка = &ГруппаПользователей
	|
	|СГРУППИРОВАТЬ ПО
	|	РабочиеГруппыСостав.Пользователь
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕжедневныйОтчет.Пользователь
	|ПОМЕСТИТЬ ХорошиеРебята
	|ИЗ
	|	Документ.ЕжедневныйОтчет КАК ЕжедневныйОтчет
	|ГДЕ
	|	ЕжедневныйОтчет.Дата МЕЖДУ &Д1 И &Д2
	|
	|СГРУППИРОВАТЬ ПО
	|	ЕжедневныйОтчет.Пользователь
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПроектныйОтдел.Пользователь,
	|	ЕСТЬNULL(ПользователиКонтактнаяИнформация.Представление, """") КАК Мыло
	|ИЗ
	|	ПроектныйОтдел КАК ПроектныйОтдел
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи.КонтактнаяИнформация КАК ПользователиКонтактнаяИнформация
	|		ПО ПроектныйОтдел.Пользователь = ПользователиКонтактнаяИнформация.Ссылка
	|ГДЕ
	|	НЕ ПроектныйОтдел.Пользователь В
	|				(ВЫБРАТЬ
	|					ХорошиеРебята.Пользователь
	|				ИЗ
	|					ХорошиеРебята КАК ХорошиеРебята)
	|	И ПользователиКонтактнаяИнформация.Вид = &Вид
	|
	|СГРУППИРОВАТЬ ПО
	|	ПроектныйОтдел.Пользователь,
	|	ЕСТЬNULL(ПользователиКонтактнаяИнформация.Представление, """")";
	
	Запрос.УстановитьПараметр("Д1", НачалоДня(ТД));
	Запрос.УстановитьПараметр("Д2", КонецДня(ТД));
	Запрос.УстановитьПараметр("Вид", Справочники.ВидыКонтактнойИнформации.EmailПользователя);
	Запрос.УстановитьПараметр("Подразделение", Справочники.СтруктураПредприятия.НайтиПоКоду("00-000008"));
	Запрос.УстановитьПараметр("ГруппаПользователей", ГруппаПользователей);
	Рез = Запрос.Выполнить().Выбрать();
	Пока Рез.Следующий() Цикл
		Если ЗначениеЗаполнено(Рез.Мыло) Тогда
			ПараметрыПисьма.Вставить("Кому", Рез.Мыло);
			ПараметрыПисьма.Вставить("Тело", "Дорогой мой дружочек-пирожочек, " + Рез.Пользователь + ", не забудь заполнить ежедневный отчет в Документообороте, ПОЖАЛУЙСТА!");
			РаботаСПочтовымиСообщениями.ОтправитьПочтовоеСообщение(Учетка, ПараметрыПисьма);
		КонецЕсли;	
	КонецЦикла;	
	
КонецПроцедуры

Процедура СинхронизацияЯндексТрекер() Экспорт
	
	Обработки.ЯндексТрекер.СинхронизироватьЗадачи();
	
КонецПроцедуры
