////////////////////////////////////////////////////////////////////////////////
// НагрузочноеТестированиеКлиентГлобальный:
//  Содержит код, реализующий алгоритм выполнения сценариев.
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Осуществляет переход к следующему шагу сценария.
// 
Функция ПерейтиКСледующемуШагуСценария() Экспорт
	
	Возврат НагрузочноеТестированиеКлиент.ПерейтиКСледующемуШагуСценарияНеГлобальный();
	
КонецФункции

#КонецОбласти
