
Процедура ПриЗаписи(Отказ, Замещение)
	
	Если Количество() = 1 Тогда
		
		ВидСобытия = Получить(0).ВидСобытия;
	
		БизнесСобытияВызовСервера.СохранитьПодпискуНаБизнесСобытия(ВидСобытия, 
			Перечисления.ПотребителиБизнесСобытий.ПользовательскаяОбработкаСобытий);
			
	ИначеЕсли Количество() = 0 Тогда // удаление
		
		КоличествоПодписчиков = ПолучитьКоличествоПодписчиков(ЭтотОбъект.Отбор.ВидСобытия.Значение);
		
		Если КоличествоПодписчиков = 0 Тогда
			БизнесСобытияВызовСервера.УдалитьПодпискуНаБизнесСобытия(ЭтотОбъект.Отбор.ВидСобытия.Значение, 
				Перечисления.ПотребителиБизнесСобытий.ПользовательскаяОбработкаСобытий);
		КонецЕсли;	
			
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьКоличествоПодписчиков(ВидСобытия)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СвязьПользовательскихОбработчиковБизнесСобытийИВидаСобытий.ВидСобытия
	               |ИЗ
	               |	РегистрСведений.СвязьПользовательскихОбработчиковБизнесСобытийИВидаСобытий КАК СвязьПользовательскихОбработчиковБизнесСобытийИВидаСобытий
	               |ГДЕ
	               |	СвязьПользовательскихОбработчиковБизнесСобытийИВидаСобытий.ВидСобытия = &ВидСобытия";
				   
	Запрос.УстановитьПараметр("ВидСобытия", ВидСобытия);				   
	
	Таблица = Запрос.Выполнить().Выгрузить();
	Возврат Таблица.Количество();
	
КонецФункции;	