
#Область ОписаниеПеременных_Схема

&НаКлиенте
Перем ИмяТекущегоЭлементаСхемыПроцесса Экспорт;

&НаКлиенте
Перем КэшНаименованийСоединительныхЛиний Экспорт;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	// Инициализируем схему, если текущий объект еще не записан
	// и схема не была инициализирована при чтении.
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		РаботаСКомплекснымиБизнесПроцессамиСервер.ИнициализироватьСхемуПроцесса(ЭтаФорма, Объект);
	КонецЕсли;
	РаботаСКомплекснымиБизнесПроцессамиКлиентСервер.НастроитьЭлементыРедактированияМаршрута(ЭтаФорма);
	
	// Заполним таблицу ФормыДействийСхемы.
	РаботаСКомплекснымиБизнесПроцессамиСервер.ЗаполнитьФормыДействийСхемы(ЭтаФорма);
	
	ЭтоНовый = Объект.Ссылка.Пустая();
	
	ПротоколированиеРаботыПользователей.ЗаписатьОткрытие(Объект.Ссылка);
	РаботаСПоследнимиОбъектами.ЗаписатьОбращениеКОбъекту(Объект.Ссылка);
	
	ПользователиПустаяСсылка = Справочники.Пользователи.ПустаяСсылка();
	Если Объект.Ссылка.Пустая() И Объект.Контролер = Неопределено Тогда 
		Объект.Контролер = Справочники.Пользователи.ПустаяСсылка();
	КонецЕсли;
	
	// Обработчик подсистемы "Свойства"
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Объект", Объект);
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтаФорма, ДополнительныеПараметры);
	Мультипредметность.УстановитьЗначенияДопРеквизитовИДоступностьЭлементовФормыПроцесса(ЭтаФорма, Объект);
	
	ИспользоватьАвтоподстановки = Ложь;
	
	Если Объект.Ссылка.Пустая() Тогда
		Объект.Автор = ПользователиКлиентСервер.ТекущийПользователь();
		Если НЕ ЗначениеЗаполнено(Объект.Важность) Тогда
			Объект.Важность = Перечисления.ВариантыВажностиЗадачи.Обычная;
		КонецЕсли;
		
		Если Не ИспользоватьСхемуПроцесса И Не ЗначениеЗаполнено(Объект.ВариантМаршрутизации) Тогда
			Объект.ВариантМаршрутизации = Перечисления.ВариантыМаршрутизацииЗадач.Последовательно;
		КонецЕсли;
	КонецЕсли;
	
	Копирование = ЗначениеЗаполнено(Параметры.ЗначениеКопирования);
	Если Объект.Ссылка.Пустая() И Не Копирование Тогда 
		
		Если Параметры.Свойство("Предметы") И Параметры.Свойство("Шаблон") Тогда
			
			Мультипредметность.ПередатьПредметыПроцессу(Объект, Параметры.Предметы, Ложь, Истина);
			ЗаполнитьПоШаблонуНаСервере(Параметры.Шаблон);
			Модифицированность = Истина;
			
		КонецЕсли;
		
	КонецЕсли;
	
	ВестиУчетПоПроектам = ПолучитьФункциональнуюОпцию("ВестиУчетПоПроектам");
	ИзменятьЗаданияЗаднимЧислом = ПолучитьФункциональнуюОпцию("ИзменятьЗаданияЗаднимЧислом");
	
	ИспользоватьВремяВСрокахЗадач = ПолучитьФункциональнуюОпцию("ИспользоватьДатуИВремяВСрокахЗадач");
	
	// Учет переносов сроков выполнения
	ПереносСроковВыполненияЗадач.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	
	// Настройки старта
	СтартПроцессовСервер.ЗаполнитьНастройкиСтартаВФормеПроцесса(ЭтаФорма);
	
	// Сроки выполнения
	УстановитьУсловноеОформлениеИстекшихСроков();
	ЗаполнитьДатыЗавершенияЭтапов();
	
	ИспользоватьДатуИВремяВСрокахЗадач = ПолучитьФункциональнуюОпцию("ИспользоватьДатуИВремяВСрокахЗадач");
	
	Если Объект.Стартован Или Не ЗначениеЗаполнено(Объект.Шаблон) Тогда
		ДатаОтсчетаДляРасчетаСроков = СрокиИсполненияПроцессов.ДатаОтсчетаДляРасчетаСроковПроцесса(Объект);
	КонецЕсли;
	
	Элементы.СрокИсполненияЭтапаПредставление.Ширина =
		СрокиИсполненияПроцессовКОРП.ШиринаПоляСрокИсполненияДействияКомплексногоПроцесса(ЭтаФорма);
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьГрафикиРаботы") Тогда
			СтрокаЗаменыДляВсплывающейПодсказки = НСтр("ru = '(по графику работ)'");
			
		Элементы.СрокИсполненияЭтапаПредставление.Подсказка = СтрЗаменить(
			Элементы.СрокИсполненияЭтапаПредставление.Подсказка,
			СтрокаЗаменыДляВсплывающейПодсказки, "");
			
		Элементы.СрокИсполненияПроцессаПредставление.Подсказка = СтрЗаменить(
			Элементы.СрокИсполненияПроцессаПредставление.Подсказка,
			СтрокаЗаменыДляВсплывающейПодсказки, "");
		
	КонецЕсли;
	
	ОбновитьСрокиИсполненияНаСервере();
	
	// Сохранение вводимых значений
	СохранениеВводимыхЗначений.ЗаполнитьСписокВыбора(ЭтаФорма, ЭлементыДляСохранения(), ЭтаФорма.ИмяФормы);
	
	ОбновитьДоступностьЭлементовФормыПоСостояниюПроцесса();
	УстановитьДоступность();
	УстановитьДоступностьПоШаблону();
	
	Если Не ИспользоватьСхемуПроцесса Тогда
		РаботаСКомплекснымиБизнесПроцессамиСервер.ЗаполнитьВычисляемыеПоляЭтапов(
			ЭтаФорма, 
			Объект.Ссылка.Пустая());
	КонецЕсли;
	
	ВестиУчетПлановыхТрудозатратВБизнесПроцессах = 
		ПолучитьФункциональнуюОпцию("ВестиУчетПлановыхТрудозатратВБизнесПроцессах");
	Элементы.ОписаниеТрудозатрат.Видимость = ВестиУчетПлановыхТрудозатратВБизнесПроцессах;
	ПолучитьДанныеПроекта();
	
	УстановитьПривилегированныйРежим(Истина);
	ПредыдущееОписаниеПредметов = МультипредметностьКлиентСервер.ПредметыСтрокой(Объект.Предметы, Истина, Ложь);
	УстановитьПривилегированныйРежим(Ложь);
	
	Если ЗначениеЗаполнено(Объект.Шаблон) Тогда
		РеквизитыШаблона = ОбщегоНазначенияДокументооборот.ЗначенияРеквизитовОбъектаВПривилегированномРежиме(
			Объект.Шаблон, "ДобавлятьНаименованиеПредмета, НаименованиеБизнесПроцесса");
		НаименованиеИзШаблона = РеквизитыШаблона.НаименованиеБизнесПроцесса;
		ДобавлятьНаименованиеПредмета = РеквизитыШаблона.ДобавлятьНаименованиеПредмета;
	КонецЕсли;
	
	// Обработчик подсистемы "Дополнительные отчеты и обработки"
	ДополнительныеОтчетыИОбработки.ПриСозданииНаСервере(ЭтаФорма);
	
	Мультипредметность.ПроцессПриСозданииНаСервере(ЭтаФорма, Объект);
	
	// Инструкции
	ПоказыватьИнструкции = ПолучитьФункциональнуюОпцию("ИспользоватьИнструкции");
	ПолучитьИнструкции();
	
	// Вычисления права на объект
	ПравоНаИзменениеБизнесПроцесса = Ложь;
	Если НЕ Объект.Ссылка.Пустая() Тогда
		ПравоНаИзменениеБизнесПроцесса = 
			ДокументооборотПраваДоступа.ПолучитьПраваПоОбъекту(Объект.Ссылка).Изменение;
	КонецЕсли;
	
	// Настройка дерева задач и списка активных задач
	РаботаСБизнесПроцессамиВызовСервера.ДеревоПроцессовИЗадач_ПриСозданииНаСервере(ЭтаФорма, Объект.Ссылка, Не Объект.Ссылка.Пустая());
	КоличествоАктивныхЗадач = СписокАктивныхЗадач.Количество();
	
	// Видимость поля Контролер.
	Элементы.Контролер.Видимость = ПолучитьФункциональнуюОпциюФормы("ИспользоватьКонтрольОбъектов");
	
	ПроверятьОтсутствие = Отсутствия.ПредупреждатьОбОтсутствии();
	
	// СтандартныеПодсистемы.Печать
	УправлениеПечатью.ПриСозданииНаСервере(ЭтаФорма, Элементы.ГруппаПечать);
	// Конец СтандартныеПодсистемы.Печать

	// СтандартныеПодсистемы.БазоваяФункциональность
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.БазоваяФункциональность
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	МультипредметностьКлиент.ПроцессПриОткрытии(ЭтаФорма, Объект);
	
	Оповестить("ОбновитьСписокПоследних");
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	РаботаСКомплекснымиБизнесПроцессамиКлиент.ИнициализироватьСхемуПроцесса(ЭтаФорма);
	ПодключитьОбработчикОжидания("ВыбратьВариантРедактированияМаршрута", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если ОбщегоНазначенияДокументооборотКлиент.ПриЗакрытии(ЗавершениеРаботы) Тогда
		Возврат;
	КонецЕсли;
	
	МультипредметностьВызовСервера.ПроцессПриЗакрытииНаСервере(Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	РаботаСБизнесПроцессамиКлиент.ОбработкаОповещенияФормаБизнесПроцесса(
		ИмяСобытия, Параметр, Источник, ЭтаФорма);
	
	Если ИмяСобытия = "Процесс_ТребуетсяЗаписьВладельцаФайла" И Параметр = УникальныйИдентификатор Тогда
		Записать();
		Оповестить("Процесс_ЗаписанВладелецФайла", Источник, Объект.Ссылка);
	ИначеЕсли ИмяСобытия = "Запись_Файл" И Параметр.Событие = "СозданФайл" И Параметр.ИдентификаторРодительскойФормы = УникальныйИдентификатор Тогда
		МультипредметностьКлиент.ОбработатьДобавлениеПредметаПроцесса(ЭтаФорма, Параметр.Файл);
	ИначеЕсли ИмяСобытия = "Перенаправление_ЗадачаИсполнителя" 
		И ОбщегоНазначенияДокументооборотВызовСервера.ЗначениеРеквизитаОбъекта(Источник, "БизнесПроцесс") = Объект.Ссылка Тогда
		
		Прочитать();
	КонецЕсли;
	
	Если ИмяСобытия = "ЗадачаВыполнена" 
		ИЛИ ИмяСобытия = "Запись_ЗадачаИсполнителя" Тогда
		
		ОбработатьЗавершениеЗадачи(Параметр);
	ИначеЕсли ИмяСобытия = "СозданиеДействия" Тогда
		
		Если ЭтаФорма = Источник
			Или Параметр.ВладелецШаблона <> Объект.Ссылка Тогда
			
			Возврат;
		КонецЕсли;
		
		Если ИспользоватьСхемуПроцесса Тогда
			ЗавершитьНастройкуЭлементаСхемыДействия(Параметр.ШаблонБП, Параметр.Предметы);
		Иначе
			ИдентификаторЭтапа = ПрименитьНастройкиДействия(Параметр);
			РаботаСКомплекснымиБизнесПроцессамиКлиент.ВычислитьОписаниеПредшественников(Объект);
			ПодключитьОбработчикОжидания("ОбновитьОписаниеПредметов",0.1, Истина);
			Модифицированность = Истина;
		КонецЕсли;
	ИначеЕсли ИмяСобытия = "ВыборШаблонаДействия" Тогда
		
		Если Объект.Ссылка <> Параметр.ВладелецШаблона Тогда
			Возврат;
		КонецЕсли;
		
		Если ИспользоватьСхемуПроцесса Тогда
			ЗавершитьНастройкуЭлементаСхемыДействия(Параметр.ШаблонБП, Параметр.Предметы);
		Иначе
			ПараметрыВозврата = СкопироватьШаблонВНастройкиПроцессаИПолучитьИмяФормы(Параметр.ШаблонБП, Параметр.ВладелецШаблона);
			Если ПараметрыВозврата.ЗаполненыНеобходимыеДляСтартаПоля Тогда
				ИдентификаторЭтапа = ПараметрыВозврата.ИдентификаторЭтапа;
				РаботаСКомплекснымиБизнесПроцессамиКлиент.ВычислитьОписаниеПредшественников(Объект);
				Модифицированность = Истина;
			Иначе
				ПараметрыФормы = Новый Структура();
				ПараметрыФормы.Вставить("Ключ", ПараметрыВозврата.Шаблон);
				ПараметрыФормы.Вставить("ВладелецШаблона", Параметр.ВладелецШаблона);
				ПараметрыФормы.Вставить("ИдентификаторЭтапа", ТекущийЭтап);
				ПараметрыФормы.Вставить("Предметы", Параметр.Предметы);
				ОткрытьФорму(ПараметрыВозврата.ИмяФормыДляОткрытия, ПараметрыФормы, ЭтаФорма);
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли ИмяСобытия = "НастройкаПорядкаВыполнения" Тогда
		Если Объект.Ссылка <> Параметр.ВладелецЭтапа Тогда
			Возврат;
		КонецЕсли;
		ДанныеЭтапа = Элементы.Этапы.ТекущиеДанные;
		ДанныеЭтапа.ПредшественникиВариантИспользования = Параметр.ПредшественникиВариантИспользования;
		РаботаСКомплекснымиБизнесПроцессамиКлиент.УстановитьПредшественниковЭтапа(Объект, ТекущийЭтап, Параметр.Предшественники);
		РаботаСКомплекснымиБизнесПроцессамиКлиент.ВычислитьОписаниеПредшественников(Объект);
		
		РеквизитСИзмененнымСроком = "Этапы";
		ИдентификаторыИзмененныхДействий.Добавить(Параметр.ИдентификаторЭтапа);
		
		ОчиститьДатуОтсчетаДляРасчетаСроков(ЭтаФорма);
		ОбновитьСрокиИсполненияОтложенно();
		
		Модифицированность = Истина;
		
	ИначеЕсли ИмяСобытия = "БизнесПроцессИзменен" Тогда
		
		// Обновим описание измененного процесса.
		
		Отбор = Новый Структура;
		Отбор.Вставить("Процесс", Параметр);
		
		НайденныеПараметры = СхемаКомплексногоПроцесса.ПараметрыДействий.НайтиСтроки(Отбор);
		
		Если НайденныеПараметры.Количество() > 0 Тогда
			
			ПараметрыДействия = НайденныеПараметры[0];
			
			РаботаСКомплекснымиБизнесПроцессамиВызовСервера.ОбновитьДанныеДействияВКэше(
				Параметр, КэшДанныхДействий);
			
			ПараметрыЭлемента = РаботаСКомплекснымиБизнесПроцессамиКлиентСервер.СтрокаЭлементаСхемы(
				СхемаКомплексногоПроцесса, ПараметрыДействия.Имя);
			
			СрокиИсполненияПроцессовКлиентСерверКОРП.
				ЗаполнитьСрокиВПараметрахДействияСхемыКомплексногоПроцесса(
					ПараметрыДействия,
					ПараметрыЭлемента,
					КэшДанныхДействий,
					ПроцессыСхемыДляПрерывания);
			
			ПоказатьТочныеСроки = 
				СрокиИсполненияПроцессовКлиентСерверКОРП.ПоказатьТочныеСрокиВКомплексномПроцессе(ЭтаФорма);
			
			ПоказатьОтносительныеСроки = 
				СрокиИсполненияПроцессовКлиентСерверКОРП.ПоказатьОтносительныеСрокиВКомплексномПроцессе(ЭтаФорма);
			
			РаботаСКомплекснымиБизнесПроцессамиКлиентСервер.ОбновитьПредставленияДействийВСхемеПроцесса(
				Схема,
				СхемаКомплексногоПроцесса.ПараметрыДействий,
				СхемаКомплексногоПроцесса.ЭлементыСхемы,
				КэшДанныхДействий,
				ИспользоватьВремяВСрокахЗадач,
				ПоказатьТочныеСроки,
				ПоказатьОтносительныеСроки,
				ПроцессыСхемыДляПрерывания);
				
		КонецЕсли;
		
	ИначеЕсли ИмяСобытия = "Процесс_ВводПричиныПрерывания" И Параметр.ВладелецФормы = ЭтаФорма Тогда
		КомандыРаботыСБизнесПроцессамиКлиент.ПрерватьБизнесПроцессИзФормыОбъектаОкончание(
			ЭтаФорма, Параметр);
	КонецЕсли;
	
	// Проверка на допустимость запуска только что настроенного действия.
	// Если для него выполнены все условия запуска и комплексный процесс запущен,
	// взводится флаг необходимости выполнить попытку запуска новых действий.
	Если Объект.Стартован
		И (ИмяСобытия = "СозданиеДействия" 
		ИЛИ ИмяСобытия = "НастройкаПорядкаВыполнения") Тогда
		ПроверитьЗапускДействий = Истина;
	КонецЕсли;
	
	Если ИмяСобытия = "ЗаписьКонтроля" 
		И Параметр.Предмет = Объект.Ссылка
		И Параметр.Свойство("Контролер") 
		И Параметр.Контролер <> Объект.Контролер Тогда 
		
		Прочитать();
	КонецЕсли;
	
	Если ИмяСобытия = "ОбновитьТрудозатратыУчастниковПроцесса" И Источник = ЭтаФорма Тогда
		ЗаполнитьОписаниеТрудозатрат(ЭтаФорма);
	КонецЕсли;
	
	// Сроки выполнения
	СрокиИсполненияПроцессовКлиент.ОбработкаОповещенияПослеПереносаСрока(
		ЭтаФорма, ИмяСобытия, Параметр, Источник);
	
	РаботаСБизнесПроцессамиКлиент.ОбработкаОповещенияДляДереваЗадач(
		ИмяСобытия, Параметр, Источник, ЭтаФорма);
	
	// СтандартныеПодсистемы.Свойства
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
	// Всегда обновляем доступность команд настройки элементов.
	РаботаСКомплекснымиБизнесПроцессамиКлиент.НастроитьДоступностьКомандНастройкиЭлементов(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	РаботаСБизнесПроцессамиВызовСервера.ПриЧтенииНаСервереФормаБизнесПроцесса(ТекущийОбъект, ЭтаФорма);
	
	РаботаСКомплекснымиБизнесПроцессамиСервер.ИнициализироватьСхемуПроцесса(ЭтаФорма, ТекущийОбъект);
	
	// Настроим доступность редактирование схемы при чтении на сервере, т.к. форма процесса
	// может быть перечитана с изменением параметров влияющих на доступность.
	НастроитьДоступностьРедактированияСхемы(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Не ИспользоватьСхемуПроцесса И ЭтапыКУдалению.Количество() > 0 Тогда
		УдалитьЭтапы();
		ЭтапыКУдалению.Очистить();
	КонецЕсли;
	
	ИзменитьРеквизитыНевыполненныхЗадач = Ложь;
	ПроверитьОтсутствиеУчастниковПроцесса = Ложь;
	
	Если ПараметрыЗаписи.Свойство("Старт") И ПараметрыЗаписи.Старт
		И ЗначениеЗаполнено(ДатаОтсчетаДляРасчетаСроков) Тогда
		
		СрокиИсполненияПроцессовКлиент.ПроверитьКорректностьЗаполненияСроковПередСтартом(
			ЭтаФорма, Объект, ПараметрыЗаписи, Отказ);
		Если Отказ Тогда
			Возврат;
		КонецЕсли;
		
		ПроверитьОтсутствиеУчастниковПроцесса = Истина;
		
	КонецЕсли;
	
	Если ПараметрыЗаписи.Свойство("Старт") И ПараметрыЗаписи.Старт ИЛИ Объект.Стартован Тогда
		
		ПроверитьЗаполнениеПроцессаПередСтартом(Отказ);
		
		Если Объект.Стартован 
			И ВестиУчетПоПроектам
			И ЗначениеЗаполнено(Объект.ПроектнаяЗадача)
			И Не ПараметрыЗаписи.Свойство("СтартоватьПриНеСоответствииСрокаПроцессаИПроектнойЗадачи")
			И Не ПараметрыЗаписи.Свойство("ПрерываниеПроцесса") Тогда
			
			// Проверка соответствия даты окончания процесса и плановой даты окончания проектной задачи
			РаботаСПроектамиКлиент.ПроверитьСоответствиеСрокаПроцессаИПроектнойЗадачи(
				Объект.ПроектнаяЗадача, 
				Объект.СрокИсполнения, 
				Отказ,
				ПараметрыЗаписи,
				УникальныйИдентификатор);
		КонецЕсли;
		Если Отказ Тогда
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	Если Объект.Стартован
		И Модифицированность 
		И Не (ПараметрыЗаписи.Свойство("Старт") И ПараметрыЗаписи.Старт) Тогда
		
		ИзменитьРеквизитыНевыполненныхЗадач = Истина;
	КонецЕсли;
	
	Если ПараметрыЗаписи.Свойство("ФоновыйСтартПроцесса")
		Или ПараметрыЗаписи.Свойство("ОтложенныйСтартПроцесса")
		Или (Не Объект.Стартован
			И Модифицированность
			И ЗначениеЗаполнено(НастройкаСтарта)
			И НастройкаСтарта.Состояние = 
				ПредопределенноеЗначение("Перечисление.СостоянияПроцессовДляЗапуска.ГотовКСтарту")) Тогда
			
		ПроверитьЗаполнениеПроцессаДляФоновогоСтарта(Отказ, ПараметрыЗаписи);
		Если Отказ Тогда
			Возврат;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДатаОтсчетаДляРасчетаСроков) Тогда
			ПроверитьОтсутствиеУчастниковПроцесса = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ПроверитьОтсутствиеУчастниковПроцесса
		И Не ОтсутствияКлиент.ПроверитьОтсутствиеПоПроцессуПередЗаписью(ЭтаФорма,
				ПараметрыЗаписи, Отказ) Тогда
				
		Возврат;
	КонецЕсли;
	
	Если Не ИспользоватьСхемуПроцесса Тогда
		РаботаСКомплекснымиБизнесПроцессамиКлиент.ВычислитьОписаниеПредшественников(Объект);
	КонецЕсли;
	
	ПодключитьОбработчикОжидания("ОбработатьРезультатПроверкиКорректностиСхемы", 0.1, Истина);
	
	// Введем причину прерывания исключенных действий.
	РаботаСКомплекснымиБизнесПроцессамиКлиент.ВвестиПричинуПрерыванияПроцессовСхемы(
		ЭтаФорма, Отказ, ПараметрыЗаписи);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// Запишем схему и выполним проверку процесса.
	// Если проверка не проходит, тогда отменяем запись схемы.
	НачатьТранзакцию();
	
	РаботаСКомплекснымиБизнесПроцессамиСервер.ПоместитьСсылкуНаНовуюСхемуВОбъект(
		ЭтаФорма, Объект);
	ТекущийОбъект.Схема = Объект.Схема;
	
	РаботаСКомплекснымиБизнесПроцессамиСервер.ЗаписатьСхемуИзФормы(
		Отказ, ТекущийОбъект, ПараметрыЗаписи, ЭтаФорма);
	
	ПроверитьЗаполнениеПроцессаПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи);
	
	Если Отказ Тогда
		ОтменитьТранзакцию();
		Возврат;
	Иначе
		ЗафиксироватьТранзакцию();
	КонецЕсли;
	
	СрокиИсполненияПроцессовКОРП.ЗаписатьРассчитанныеТочныеСрокиКомплексногоПроцессаПоСхеме(
		ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);
	
	Если Не ИспользоватьСхемуПроцесса Тогда
		ПараметрыЗаписи.Вставить("СрокиЭтапов",
			СрокиИсполненияПроцессов.СрокиДействийПроцесса(Объект.Этапы, "ИдентификаторЭтапа"));
	КонецЕсли;
	
	Если ИзменитьРеквизитыНевыполненныхЗадач Тогда
		СтарыеУчастникиПроцесса = БизнесПроцессыИЗадачиВызовСервера.
			ТекущиеУчастникиПроцесса(ТекущийОбъект);
		ТекущийОбъект.ДополнительныеСвойства.Вставить("СтарыеУчастникиПроцесса", СтарыеУчастникиПроцесса);
	КонецЕсли;
	
	Мультипредметность.ОчиститьНезаполненныеПредметыПроцесса(Объект);
	
	ПараметрыЗаписи.Вставить("ЭтоНовыйОбъект", НЕ ЗначениеЗаполнено(ТекущийОбъект.Ссылка));
	
	// Обработчик подсистемы "Свойства"
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтаФорма, ТекущийОбъект);
	
	// Установим состояние записываемому процессу.
	РаботаСБизнесПроцессами.УстановитьСостояниеПроцессуПередЗаписьюИзФормыОбъекта(
		ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ИзменитьРеквизитыНевыполненныхЗадач Тогда
		ТекущийОбъект.ИзменитьРеквизитыНевыполненныхЗадач(
			ТекущийОбъект.ДополнительныеСвойства.СтарыеУчастникиПроцесса, ПараметрыЗаписи);
	КонецЕсли;
	
	Если Не ИспользоватьСхемуПроцесса И ПроверитьЗапускДействий Тогда
		
		НовыеПроцессы = Новый Массив();
		ТекущийОбъект.СтартоватьНовыеДействия(
			НовыеПроцессы, 
			БизнесПроцессы.КомплексныйПроцесс.ТочкиМаршрута.ВложенныйПроцесс, 
			Истина);
		
		ПроверитьЗапускДействий = Ложь;
		
	КонецЕсли;
	
	// Сохранение вводимых значений
	СохранениеВводимыхЗначений.ОбновитьСпискиВыбора(ЭтаФорма, ЭлементыДляСохранения(), ЭтаФорма.ИмяФормы);
	
	// Настройки старта
	СтартПроцессовСервер.ОбновитьНастройкиСтартаПроцессаИзФормы(
		ТекущийОбъект.Ссылка, ПараметрыЗаписи, НастройкаСтарта);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ПротоколированиеРаботыПользователей.ЗаписатьСоздание(Объект.Ссылка, ПараметрыЗаписи.ЭтоНовыйОбъект);
	ПротоколированиеРаботыПользователей.ЗаписатьИзменение(Объект.Ссылка);
	ПротоколированиеРаботыПользователей.ЗаписатьСтартБизнесПроцесса(
		Объект.Ссылка,
		ОбщегоНазначенияКлиентСервер.СкопироватьСтруктуру(ПараметрыЗаписи));
	
	Если ИспользоватьСхемуПроцесса Тогда
		РаботаСКомплекснымиБизнесПроцессамиСервер.ЗагрузитьСхемуВФормуПослеЗаписи(ЭтаФорма, ПараметрыЗаписи);
	Иначе
		
		СрокиЭтапов = ПараметрыЗаписи.СрокиЭтапов;
		
		УстановитьПривилегированныйРежим(Истина);
		
		Объект.Этапы.Очистить();
		Для Каждого Этап Из ТекущийОбъект.Этапы Цикл
			
			ВладелецШаблона = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
				Этап.ШаблонБизнесПроцесса, "ВладелецШаблона");
				
			Если ВладелецШаблона <> ТекущийОбъект.Ссылка Тогда
				ШаблонОбъект = Этап.ШаблонБизнесПроцесса.ПолучитьОбъект();
				ШаблонОбъект.ВладелецШаблона = ТекущийОбъект.Ссылка;
				ШаблонОбъект.ШаблонВКомплексномПроцессе = Истина;
				ШаблонОбъект.Записать();
			КонецЕсли;
			
			НоваяСтрока = Объект.Этапы.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Этап);
		КонецЦикла;
		РаботаСКомплекснымиБизнесПроцессамиСервер.ЗаполнитьВычисляемыеПоляЭтапов(ЭтаФорма, Ложь);
		
		УстановитьПривилегированныйРежим(Ложь);
		
		СрокиИсполненияПроцессов.ЗаполнитьСрокиВТаблицеДействий(
			СрокиЭтапов, Объект.Этапы, "ИдентификаторЭтапа");
		
	КонецЕсли;
	
	ОбновитьПризнакиИстекшихСроков();
	
	УстановитьДоступность();
	
	Мультипредметность.ПроцессПослеЗаписиНаСервере(ЭтаФорма, Объект);
	
	ОбновитьДоступностьЭлементовФормыПоСостояниюПроцесса();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("БизнесПроцессИзменен", Объект.Ссылка, ЭтаФорма);
	
	Если ПараметрыЗаписи.Свойство("Старт") И ПараметрыЗаписи.Старт Тогда
		
		Если Объект.Предметы.Количество() = 0 Тогда 
			
			ИнформацияОЗапуске = Новый Структура;
			ИнформацияОЗапуске.Вставить("СсылкаНаБизнесПроцесс", Объект.Ссылка);
			ИнформацияОЗапуске.Вставить("СсылкаНаПредметБизнесПроцесса", Неопределено);
			Если ВестиУчетПоПроектам Тогда
				ИнформацияОЗапуске.Вставить("Проект", Объект.Проект);
				ИнформацияОЗапуске.Вставить("ПроектнаяЗадача", Объект.ПроектнаяЗадача);
			КонецЕсли;
			Оповестить("БизнесПроцессСтартован", ИнформацияОЗапуске);
			
		Иначе
		
			Для Каждого СтрокаПредмета из Объект.Предметы Цикл
				Если ЗначениеЗаполнено(СтрокаПредмета.Предмет) Тогда
					ДелопроизводствоКлиент.ОповеститьОбИзмененииОбъекта(СтрокаПредмета.Предмет);
				КонецЕсли;
				
				ИнформацияОЗапуске = Новый Структура();
				ИнформацияОЗапуске.Вставить("СсылкаНаБизнесПроцесс", Объект.Ссылка);
				ИнформацияОЗапуске.Вставить("СсылкаНаПредметБизнесПроцесса", СтрокаПредмета.Предмет);
				Если ВестиУчетПоПроектам Тогда
					ИнформацияОЗапуске.Вставить("Проект", Объект.Проект);
					ИнформацияОЗапуске.Вставить("ПроектнаяЗадача", Объект.ПроектнаяЗадача);
				КонецЕсли;
				Оповестить("БизнесПроцессСтартован", ИнформацияОЗапуске);
				
			КонецЦикла;
		
		КонецЕсли;
		
	КонецЕсли;
	
	РаботаСБизнесПроцессамиКлиент.ПоказатьОповещениеПослеЗаписиПроцесса(ЭтаФорма, ПараметрыЗаписи);
	
	РаботаСКомплекснымиБизнесПроцессамиКлиент.НастроитьДоступностьКомандНастройкиЭлементов(ЭтаФорма);
	
	СрокиИсполненияПроцессовКлиентКОРП.ПоказатьСообщениеОЗавершенииРасчетаСроков(ПараметрыЗаписи);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтаФорма, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)

	Если Настройки["ПоказыватьИнструкции"] <> Неопределено
		И ПолучитьФункциональнуюОпцию("ИспользоватьИнструкции") Тогда
		ПолучитьИнструкции();
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ГруппаСтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если ТекущаяСтраница = Элементы.ГруппаГлавное
		И РеквизитСИзмененнымСроком = "Схема" Тогда
		
		ОбновитьСрокиИсполненияОтложенно();
	КонецЕсли;
	
	ПодключитьОбработчикОжидания("ОбновитьДеревоПроцессовЗадач", 0.2, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияОписаниеНажатие(Элемент)
	
	Если Объект.Состояние = ПредопределенноеЗначение(
		"Перечисление.СостоянияБизнесПроцессов.Прерван") Тогда
		
		КомандыРаботыСБизнесПроцессамиКлиент.ПоказатьПричинуПрерывания(ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияОписаниеОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	РаботаСБизнесПроцессамиКлиент.ДекорацияОписаниеОбработкаНавигационнойСсылки(
		Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ВажностьПриИзменении(Элемент)
	
	Если Объект.Важность = ПредопределенноеЗначение("Перечисление.ВариантыВажностиЗадачи.Высокая")
		ИЛИ Объект.Важность = ПредопределенноеЗначение("Перечисление.ВариантыВажностиЗадачи.Низкая") Тогда
		УстановитьВажностьВсехЭтапов(Объект.Важность);
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ВариантМаршрутизацииПриИзменении(Элемент)
	
	ВариантМаршрутизацииПриИзмененииСервер();
	РаботаСКомплекснымиБизнесПроцессамиКлиент.ВычислитьОписаниеПредшественников(Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ГлавнаяЗадачаОткрытие(Элемент, СтандартнаяОбработка)
	
	БизнесПроцессыИЗадачиКлиент.ОткрытьФормуВыполненияЗадачи(Объект.ГлавнаяЗадача);
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ОписаниеТрудозатратНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Настройки = Новый Структура;
	Настройки.Вставить("ЕдиницаИзмеренияТрудозатрат", ЕдиницаТрудозатрат);
	Настройки.Вставить("ТолькоПросмотр", ТолькоПросмотр);
	Настройки.Вставить("Участники", Новый Массив);
	
	ТрудозатратыКонтролера = РаботаСБизнесПроцессамиКлиент.
		СтруктураСтрокиТрудозатратУчастникаПроцесса(
			НСтр("ru = 'Контролер'"),
			"ТрудозатратыПланКонтролера",
			Объект.ТрудозатратыПланКонтролера,
			Объект.Контролер);
	Настройки.Участники.Добавить(ТрудозатратыКонтролера);
	
	РаботаСБизнесПроцессамиКлиент.НастроитьТрудозатратУчастниковПроцесса(ЭтаФорма, Настройки);
	
КонецПроцедуры

// Шаблоны текста для наименования и описания
&НаКлиенте
Процедура НаименованиеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	РаботаСБизнесПроцессамиКлиент.ВыбратьШаблонТекстаРеализация(ЭтаФорма, "Наименование",
		ПредопределенноеЗначение("Перечисление.ОбластиПримененияШаблоновТекстов.ПроцессКомплексныйНаименование"));
	
КонецПроцедуры

&НаКлиенте
Процедура ОписаниеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	РаботаСБизнесПроцессамиКлиент.ВыбратьШаблонТекстаРеализация(ЭтаФорма, "Описание",
		ПредопределенноеЗначение("Перечисление.ОбластиПримененияШаблоновТекстов.ПроцессКомплексныйОписание"));

КонецПроцедуры

&НаКлиенте
Процедура НаименованиеАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Текст) Тогда 
		ДанныеВыбора = РаботаСШаблонамиТекстовСервер.СформироватьДанныеВыбораШаблона(
			ПараметрыПолученияДанных, 
			ПредопределенноеЗначение("Перечисление.ОбластиПримененияШаблоновТекстов.ПроцессКомплексныйНаименование"));
			
		Если ДанныеВыбора.Количество() <> 0 Тогда
			СтандартнаяОбработка = Ложь;
		КонецЕсли;
			
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура")  Тогда 
		Объект.Наименование = ВыбранноеЗначение.Шаблон;
		Модифицированность = Истина;	
	КонецЕсли;	
	
КонецПроцедуры
// Шаблоны текста для наименования и описания

&НаКлиенте
Процедура СрокИсполненияПроцессаПредставлениеОбработкаНавигационнойСсылки(
	Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДатаОтсчетаДляРасчетаСроков = ТекущаяДата();
	ОбновитьСрокиИсполненияНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы_Контролер

&НаКлиенте
Процедура КонтролерПриИзменении(Элемент)
	
	РаботаСБизнесПроцессамиКлиент.УчастникПриИзменении(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура КонтролерНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	РаботаСБизнесПроцессамиКлиент.УчастникНачалоВыбора(
		Элемент, Объект.Контролер, СтандартнаяОбработка, ЭтаФорма, "Контролер");
	
КонецПроцедуры

&НаКлиенте
Процедура КонтролерОчистка(Элемент, СтандартнаяОбработка)
	
	РаботаСБизнесПроцессамиКлиент.УчастникОчистка(СтандартнаяОбработка,
		ЭтаФорма, "Контролер");
	
КонецПроцедуры

&НаКлиенте
Процедура КонтролерОткрытие(Элемент, СтандартнаяОбработка)
	
	РаботаСБизнесПроцессамиКлиент.УчастникОткрытие(СтандартнаяОбработка,
		ЭтаФорма, "Контролер");
	
КонецПроцедуры

&НаКлиенте
Процедура КонтролерОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	РаботаСБизнесПроцессамиКлиент.УчастникОбработкаВыбора(СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура КонтролерАвтоПодбор(Элемент, Текст, ДанныеВыбора, Ожидание, СтандартнаяОбработка)
	
	РаботаСБизнесПроцессамиКлиент.УчастникАвтоПодбор(Текст, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура КонтролерОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка)
	
	РаботаСБизнесПроцессамиКлиент.
		УчастникОкончаниеВводаТекста(Текст, ДанныеВыбора, СтандартнаяОбработка,
			ЭтаФорма, "Контролер");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы_ПроектЗадача

&НаКлиенте
Процедура ПроектЗадачаПриИзменении(Элемент)
	
	Если Не ЗначениеЗаполнено(ПроектЗадача) Тогда 
		Объект.Проект = Неопределено;
		Объект.ПроектнаяЗадача = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроектЗадачаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	РаботаСПроектамиКлиент.ВыбратьПроектЗадачу(Элемент, Объект.Проект, Объект.ПроектнаяЗадача);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроектЗадачаОчистка(Элемент, СтандартнаяОбработка)
	
	Объект.Проект = Неопределено;
	Объект.ПроектнаяЗадача = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроектЗадачаОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если ЗначениеЗаполнено(Объект.ПроектнаяЗадача) Тогда 
		ПоказатьЗначение(, Объект.ПроектнаяЗадача);
	ИначеЕсли ЗначениеЗаполнено(Объект.Проект) Тогда 
		ПоказатьЗначение(, Объект.Проект);
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПроектЗадачаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда 	
		Объект.Проект = ВыбранноеЗначение.Проект;
		Объект.ПроектнаяЗадача = ВыбранноеЗначение.ПроектнаяЗадача;
		ПолучитьДанныеПроекта();
		
		Модифицированность = Истина;
	КонецЕсли;	
		
КонецПроцедуры

&НаКлиенте
Процедура ПроектЗадачаАвтоПодбор(Элемент, Текст, ДанныеВыбора, Ожидание, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Текст) Тогда 
		СтандартнаяОбработка = Ложь;
		ДанныеВыбора = РаботаСПроектами.СформироватьДанныеВыбораПроектаЗадачи(Текст);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроектЗадачаОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Текст) Тогда 
		ДанныеВыбораПроектаЗадачи = РаботаСПроектами.СформироватьДанныеВыбораПроектаЗадачи(Текст);
		
		Если ДанныеВыбораПроектаЗадачи.Количество() = 1 Тогда 
			ВыбранноеЗначение = ДанныеВыбораПроектаЗадачи[0].Значение;
			
			Объект.Проект = ВыбранноеЗначение.Проект;
			Объект.ПроектнаяЗадача = ВыбранноеЗначение.ПроектнаяЗадача;
			ПроектЗадача = РаботаСПроектамиКлиентСервер.ПредставлениеПроектаЗадачи(Объект.Проект, Объект.ПроектнаяЗадача);
		Иначе	
			СтандартнаяОбработка = Ложь;
			ДанныеВыбора = ДанныеВыбораПроектаЗадачи;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы_Схема

&НаКлиенте
Процедура СхемаПриИзменении(Элемент)
	
	РаботаСКомплекснымиБизнесПроцессамиКлиент.ОпределитьИмяТекущегоЭлементаПриИзмененииСхемы(ЭтаФорма);
	
	// При любом изменении схемы процесса всегда обновляем
	// данные о ее элементах. Это нужно для сохранения
	// точного соответствия реквизита Схема и объекта СхемаКомплексногоПроцесса.
	ПодключитьОбработчикОжидания("ОбновитьДанныеСхемыКомплексногоПроцесса", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура СхемаВыбор(Элемент)
	
	РаботаСКомплекснымиБизнесПроцессамиКлиент.НастроитьЭлементСхемы(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура СхемаПриАктивизации(Элемент)
	
	РаботаСКомплекснымиБизнесПроцессамиКлиент.ОпределитьИмяТекущегоЭлементаПриАктивизацииСхемы(ЭтаФорма);
	
	РаботаСКомплекснымиБизнесПроцессамиКлиент.НастроитьДоступностьКомандНастройкиЭлементов(ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_Предметы

&НаКлиенте
Процедура ПредметыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая() Тогда
		Если Не Записать() Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения(
		"ПредметыВыборПродолжение",
		ЭтотОбъект);
	МультипредметностьКлиент.ПредметыПроцессаИзменитьПредмет(ЭтаФорма, Объект, ВыбраннаяСтрока, СтандартнаяОбработка, ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПредметыВыборПродолжение(Результат, Параметры) Экспорт
	
	ПредметыПредметПриИзменении();
	
КонецПроцедуры

&НаКлиенте
Процедура ПредметыПриАктивизацииСтроки(Элемент)
	
	МультипредметностьКлиент.ОбновитьОтображениеКомандыОсновнойПредметВПроцессе(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПредметыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	ОписаниеОповещения = Новый ОписаниеОповещения(
		"ПредметыПередНачаломДобавленияПродолжение",
		ЭтотОбъект);
	МультипредметностьКлиент.ПредметыПроцессаПередНачаломДобавления(ЭтаФорма, Объект, Отказ, Копирование, ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПредметыПередНачаломДобавленияПродолжение(Результат, Параметры) Экспорт
	
	ПредметыПредметПриИзменении();
	
КонецПроцедуры

&НаКлиенте
Процедура ПредметыПередУдалением(Элемент, Отказ)
	
	МультипредметностьКлиент.ПредметыПередУдалением(ЭтаФорма, Объект, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ПредметыПослеУдаления(Элемент)
	
	МультипредметностьКлиентСервер.УстановитьДоступностьКнопокУправленияПредметами(ЭтаФорма);
	МультипредметностьКлиентСервер.УстановитьВидимостьТаблицыПредметов(ЭтаФорма, Объект);
	ПредметыПредметПриИзменении();
	
КонецПроцедуры

&НаКлиенте
Процедура ПредметыПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ПредметыПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	МультипредметностьКлиент.ОбработкаПеретаскиванияВСписокПредметовПроцесса(
		ЭтаФорма, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПредметыОписаниеПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Предметы.ТекущиеДанные;
	
	ТекущаяСтрока.РольПредмета = ПредопределенноеЗначение("Перечисление.РолиПредметов."+ТекущаяСтрока.Описание);
	Если МультипредметностьКлиент.ПредметыПроцессаИзменитьПредмет(ЭтаФорма, Объект, ТекущаяСтрока.ПолучитьИдентификатор()) Тогда
		ПредметыПредметПриИзменении();
	Иначе
		Если НЕ ЗначениеЗаполнено(ТекущаяСтрока.ИмяПредмета) Тогда
			Объект.Предметы.Удалить(ТекущаяСтрока);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_Этапы

&НаКлиенте
Процедура ЭтапыПриИзменении(Элемент)
	
	ВариантМаршрутизацииПриИзмененииСервер();
	РаботаСКомплекснымиБизнесПроцессамиКлиент.ВычислитьОписаниеПредшественников(Объект);
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ЭтапыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если Элемент.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если Поле.Имя <> "ЭтапыПредшественникиЭтапаСтрокой" Тогда
		ИзменитьДействиеКлиент();
	Иначе
		РаботаСКомплекснымиБизнесПроцессамиКлиент.ОткрытьФормуНастройкиПредшественниковЭтапа(Объект, Элемент.ТекущиеДанные, ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЭтапыПриАктивизацииСтроки(Элемент)
		 
	ДанныеЭтапа = Элементы.Этапы.ТекущиеДанные;
	Если ДанныеЭтапа = Неопределено Тогда
		Элементы.НастроитьДействие.Доступность = Ложь;
		Элементы.КонтекстноеМенюНастроитьДействие.Доступность = Ложь;
		Элементы.ЭтапыПредшественникиЭтапаСтрокой.Доступность = Ложь;
		Возврат;
	КонецЕсли;
	Если ТекущийЭтап = ДанныеЭтапа.ИдентификаторЭтапа Тогда
		Возврат;
	КонецЕсли;
	          	
	Если Объект.Завершен Или Не ДоступностьПоШаблону Тогда
		Элементы.ГруппаКоманднаяПанельСписка.Доступность = Ложь;
		Возврат;
	КонецЕсли;
			
	Элементы.ЭтапыУдалить.Доступность = НЕ ЗначениеЗаполнено(ДанныеЭтапа.ЗапущенныйБизнесПроцесс);
	Элементы.ЭтапыКонтекстноеМенюУдалить.Доступность = НЕ ЗначениеЗаполнено(ДанныеЭтапа.ЗапущенныйБизнесПроцесс);	
	Элементы.НастроитьДействие.Доступность = НЕ (ЗначениеЗаполнено(ДанныеЭтапа.ЗапущенныйБизнесПроцесс) И НЕ ДанныеЭтапа.ЗадачаВыполнена);
	Элементы.КонтекстноеМенюНастроитьДействие.Доступность = Элементы.НастроитьДействие.Доступность;
	Элементы.ЭтапыПредшественникиЭтапаСтрокой.ТолькоПросмотр = Не Элементы.НастроитьДействие.Доступность;
	Элементы.ЭтапыПредшественникиЭтапаСтрокой.Доступность = Элементы.НастроитьДействие.Доступность;
	ТекущийЭтап = ДанныеЭтапа.ИдентификаторЭтапа;
	
КонецПроцедуры

&НаКлиенте
Процедура ЭтапыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Отказ = Истина;
	
	Если Не РаботаСКомплекснымиБизнесПроцессамиКлиент.
		ЗаписатьНовыйПроцессПередДобавлениемДействия(ЭтаФорма) Тогда
		
		Возврат;
	КонецЕсли;
	
	ДатаОтсчета = Дата(1,1,1);
	Если ЗначениеЗаполнено(ДатаОтсчетаДляРасчетаСроков) Тогда
		ДатаОтсчета = СрокиИсполненияПроцессовКлиентСерверКОРП.
			ДатаОтсчетаНовогоДействияКомплексногоПроцессаВФорме(ЭтаФорма);
	КонецЕсли;
	
	РаботаСКомплекснымиБизнесПроцессамиКлиент.ОткрытьФормуВыбораДействияЭтапа(
		Неопределено, 
		ЭтаФорма, 
		Объект.Ссылка, 
		Объект.Предметы,
		ДатаОтсчета);
		
КонецПроцедуры

&НаКлиенте
Процедура ЭтапыПередНачаломИзменения(Элемент, Отказ)
	
	Отказ = Истина;
	Если Элемент.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ИзменитьДействиеКлиент();
	
КонецПроцедуры

&НаКлиенте
Процедура ЭтапыПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	
	ДанныеЭтапа = Элементы.Этапы.ТекущиеДанные;
	Если ДанныеЭтапа = Неопределено Тогда	
		Возврат;
	КонецЕсли;
	
	НаЭтапЕстьСсылки = Ложь;
	Для Каждого Строка Из Объект.ПредшественникиЭтапов Цикл
		Если Строка.ИдентификаторПредшественника = ДанныеЭтапа.ИдентификаторЭтапа Тогда
			НаЭтапЕстьСсылки = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Если НаЭтапЕстьСсылки Тогда
		ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Внимание! От данного действия зависит порядок выполнения других действий.
						|Удалить действие ""%1""?'"),
			ДанныеЭтапа.ЗадачаЭтапа);
	Иначе	
		ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Удалить действие ""%1""?'"),
			ДанныеЭтапа.ЗадачаЭтапа);
	КонецЕсли;
	Режим = Новый СписокЗначений;
	Режим.Добавить(КодВозвратаДиалога.Да, НСтр("ru = 'Удалить'"));
	Режим.Добавить(КодВозвратаДиалога.Нет, НСтр("ru = 'Не удалять'"));
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЭтапыПередУдалениемПродолжение", ЭтотОбъект, ДанныеЭтапа);
	
	ПоказатьВопрос(ОписаниеОповещения,ТекстВопроса, Режим, 0, КодВозвратаДиалога.Нет);
	
КонецПроцедуры

&НаКлиенте
Процедура ЭтапыПередУдалениемПродолжение(Ответ, ДанныеЭтапа) Экспорт
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	СтруктураУдаляемогоЭтапа = Новый Структура();
	СтруктураУдаляемогоЭтапа.Вставить("ЗадачаЭтапа", ДанныеЭтапа.ЗадачаЭтапа);
	СтруктураУдаляемогоЭтапа.Вставить("ИдентификаторЭтапа", ДанныеЭтапа.ИдентификаторЭтапа);
	Элементы.Этапы.ТекущиеДанные.Удален = Истина;
	ЭтапыКУдалению.Добавить(СтруктураУдаляемогоЭтапа);
	РаботаСКомплекснымиБизнесПроцессамиКлиент.ВычислитьОписаниеПредшественников(Объект);
	Для Счетчик = 1 по Объект.Этапы.Количество() - 1 Цикл
		Этап = Объект.Этапы[Счетчик]; 
		Если Не ПустаяСтрока(Этап.ПредшественникиЭтапаСтрокой) Тогда
			Продолжить;
		КонецЕсли;
		НоваяСтрока = Объект.ПредшественникиЭтапов.Добавить();
		НоваяСтрока.ИдентификаторПоследователя = Объект.Этапы[Счетчик].ИдентификаторЭтапа;
		
		НовыйПредшественникПодобран = Ложь;
		Для Индекс = 1 по Счетчик Цикл
			ДействительныйИндекс = Счетчик - Индекс;
			Если Не Объект.Этапы[ДействительныйИндекс].Удален Тогда
				НоваяСтрока.ИдентификаторПредшественника = Объект.Этапы[ДействительныйИндекс].ИдентификаторЭтапа;	
				НовыйПредшественникПодобран = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Если НЕ НовыйПредшественникПодобран Тогда
			НоваяСтрока.ИдентификаторПредшественника = УникальныйИдентификаторПустой();	
		КонецЕсли;
		
		НоваяСтрока.УсловиеРассмотрения = ПредопределенноеЗначение("Перечисление.УсловияРассмотренияПредшественниковЭтапа.ПослеУспешногоВыполнения");
		
		РеквизитСИзмененнымСроком = "Этапы";
		ИдентификаторыИзмененныхДействий.Добавить(Объект.Этапы[Счетчик].ИдентификаторЭтапа);
	КонецЦикла;
	РаботаСКомплекснымиБизнесПроцессамиКлиент.ВычислитьОписаниеПредшественников(Объект);
	
	ОчиститьДатуОтсчетаДляРасчетаСроков(ЭтаФорма);
	ОбновитьСрокиИсполненияОтложенно();
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ЭтапыПослеУдаления(Элемент)
	
	ПослеУдаленияДействия();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_ДеревоЗадач

&НаКлиенте
Процедура ДеревоЗадачПриАктивизацииСтроки(Элемент)
	
	РаботаСБизнесПроцессамиКлиент.ДеревоЗадачПриАктивизацииСтроки(Элемент, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоЗадачВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	РаботаСБизнесПроцессамиКлиент.ДеревоЗадачВыбор(
		Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоЗадачПередНачаломИзменения(Элемент, Отказ)
	
	РаботаСБизнесПроцессамиКлиент.ДеревоЗадачПередНачаломИзменения(Элемент, Отказ, ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_СписокАктивныхЗадач

&НаКлиенте
Процедура СписокАктивныхЗадачВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	РаботаСБизнесПроцессамиКлиент.
		СписокАктивныхЗадачВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокАктивныхЗадачПриАктивизацииСтроки(Элемент)
	
	РаботаСБизнесПроцессамиКлиент.СписокАктивныхЗадачПриАктивизацииСтроки(Элемент, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокАктивныхЗадачПередНачаломИзменения(Элемент, Отказ)
	
	РаботаСБизнесПроцессамиКлиент.СписокАктивныхЗадачПередНачаломИзменения(
		Элемент, Отказ, ЭтаФорма);
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СтартоватьИЗакрыть(Команда)
	
	КомандыРаботыСБизнесПроцессамиКлиент.СтартоватьИЗакрыть(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДатуОтложенногоСтарта(Команда)
	
	СтартПроцессовКлиент.УстановитьДатуОтложенногоСтарта(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьДействие(Команда)

	Если Не РаботаСКомплекснымиБизнесПроцессамиКлиент.
		ЗаписатьНовыйПроцессПередДобавлениемДействия(ЭтаФорма) Тогда
		
		Возврат;
	КонецЕсли;
	
	ДатаОтсчета = Дата(1,1,1);
	Если ЗначениеЗаполнено(ДатаОтсчетаДляРасчетаСроков) Тогда
		ДатаОтсчета = СрокиИсполненияПроцессовКлиентСерверКОРП.
			ДатаОтсчетаНовогоДействияКомплексногоПроцессаВФорме(ЭтаФорма);
	КонецЕсли;
	
	РаботаСКомплекснымиБизнесПроцессамиКлиент.ОткрытьФормуВыбораДействияЭтапа(
		Неопределено, 
		ЭтаФорма, 
		Объект.Ссылка, 
		Объект.Предметы,
		ДатаОтсчета);
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьДействие(Команда)
	
	ТекущиеДанные = Элементы.Этапы.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не РаботаСКомплекснымиБизнесПроцессамиКлиент.
		ЗаписатьНовыйПроцессПередДобавлениемДействия(ЭтаФорма) Тогда
		
		Возврат;
	КонецЕсли;
	
	ВыполнитьНастройкуДействия(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ПометитьНаУдаление(Команда)
	
	РаботаСБизнесПроцессамиКлиент.ПометитьНаУдалениеБизнесПроцесс(ЭтаФорма);
	НастроитьДоступностьРедактированияСхемы(ЭтаФорма);
	РаботаСКомплекснымиБизнесПроцессамиКлиент.НастроитьДоступностьКомандНастройкиЭлементов(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьГлавнуюЗадачу(Команда)
	
	РаботаСБизнесПроцессамиКлиент.УстановитьГлавнуюЗадачуБизнесПроцессИзФормыОбъекта(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура Остановить(Команда)
	
	КомандыРаботыСБизнесПроцессамиКлиент.ОстановитьБизнесПроцессИзФормыОбъекта(ЭтаФорма);
	НастроитьДоступностьРедактированияСхемы(ЭтаФорма);
	РаботаСКомплекснымиБизнесПроцессамиКлиент.НастроитьДоступностьКомандНастройкиЭлементов(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьБизнесПроцесс(Команда)
	
	КомандыРаботыСБизнесПроцессамиКлиент.ПродолжитьБизнесПроцессИзФормыОбъекта(ЭтаФорма);
	НастроитьДоступностьРедактированияСхемы(ЭтаФорма);
	РаботаСКомплекснымиБизнесПроцессамиКлиент.НастроитьДоступностьКомандНастройкиЭлементов(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПрерватьБизнесПроцесс(Команда)
	
	КомандыРаботыСБизнесПроцессамиКлиент.ПрерватьБизнесПроцессИзФормыОбъекта(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоШаблону(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения(
		"ЗаполнитьПоШаблонуПродолжение",
		ЭтотОбъект);
	ШаблоныБизнесПроцессовКлиент.ВыбратьШаблонБизнесПроцесса(
		"ШаблоныКомплексныхБизнесПроцессов", , ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоШаблонуПродолжение(РезультатВыбора, Параметры) Экспорт
	
	Если ЗначениеЗаполнено(РезультатВыбора) Тогда 
		ЗаполнитьПоШаблонуНаСервере(РезультатВыбора);
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьКакШаблон(Команда)
	
	ШаблонСсылка = СохранитьКакШаблонСервер();
	Если ЗначениеЗаполнено(ШаблонСсылка) Тогда
		ПоказатьОповещениеПользователя(НСтр("ru = 'Создан шаблон процесса.'"), 
			ПолучитьНавигационнуюСсылку(ШаблонСсылка),
			Строка(ШаблонСсылка));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьПовторение(Команда)
	
	ПовторениеБизнесПроцессовКлиент.НастроитьПовторениеИзФормыОбъекта(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура Подписаться(Команда)
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПараметрыФормы = Новый Структура("ОбъектПодписки", Объект.Ссылка);
		ОткрытьФорму("ОбщаяФорма.ПодпискаНаУведомленияПоОбъекту", ПараметрыФормы);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	
	РаботаСБизнесПроцессамиКлиент.ЗаписатьИЗакрыть(Команда, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПраваДоступа(Команда)
	
	ДокументооборотПраваДоступаКлиент.ОткрытьФормуПравДоступа(ЭтаФорма);
	
КонецПроцедуры

// СтандартныеПодсистемы.Печать
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуПечати(Команда)
	
	УправлениеПечатьюКлиент.ВыполнитьПодключаемуюКомандуПечати(Команда, ЭтаФорма, Объект);
	
КонецПроцедуры
// Конец СтандартныеПодсистемы.Печать

// СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки
&НаКлиенте
Процедура Подключаемый_ВыполнитьНазначаемуюКоманду(Команда)
	
	Если НЕ ДополнительныеОтчетыИОбработкиКлиент.ВыполнитьНазначаемуюКомандуНаКлиенте(ЭтаФорма, Команда.Имя) Тогда
		РезультатВыполнения = Неопределено;
		ДополнительныеОтчетыИОбработкиВыполнитьНазначаемуюКомандуНаСервере(Команда.Имя, РезультатВыполнения);
	КонецЕсли;
	
КонецПроцедуры
// Конец СтандартныеПодсистемы.БазоваяФункциональность

#КонецОбласти

#Область ОбработчикиКомандФормы_Предметы

&НаКлиенте
Процедура ДобавитьПредмет(Команда)
	
	МультипредметностьКлиент.ПредметыДобавитьВспомогательный(ЭтаФорма, Объект, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьЗаполняемыйПредмет(Команда)
	
	МультипредметностьКлиент.ПредметыДобавитьЗаполняемый(ЭтаФорма, Объект, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьФайл(Команда)
	
	МультипредметностьКлиент.ПредметыДобавитьВспомогательный(
		ЭтаФорма, Объект, Истина,, Тип("СправочникСсылка.Файлы"));
	
КонецПроцедуры

&НаКлиенте
Процедура ОсновнойПредмет(Команда)
	
	МультипредметностьКлиент.ОсновнойПредмет(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьПредмет(Команда)
	
	ВыбраннаяСтрока = Элементы.Предметы.ТекущаяСтрока;
	Если ВыбраннаяСтрока <> Неопределено Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения(
			"ИзменитьПредметПродолжение",
			ЭтотОбъект);
		МультипредметностьКлиент.ПредметыПроцессаИзменитьПредмет(ЭтаФорма, Объект, ВыбраннаяСтрока,, ОписаниеОповещения);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьПредметПродолжение(Результат, Параметры) Экспорт
	
	ПредметыПредметПриИзменении();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы_Схема

&НаКлиенте
Процедура ПроверитьСхемуИНастройки(Команда)
	
	ОчиститьСообщения();
	
	РезультатПроверки = ПроверитьСхемуИНастройкиНаСервере();
	
	Если РезультатПроверки.ОписаниеОшибкиНекорректнойСхемы <> Неопределено Тогда
		
		Если Не РезультатПроверки.ОписаниеОшибкиНекорректнойСхемы.НетОшибок Тогда
			РезультатПроверкиКорректностиСхемы = РезультатПроверки.ОписаниеОшибкиНекорректнойСхемы;
			ОбработатьРезультатПроверкиКорректностиСхемы();
		КонецЕсли;
		
	КонецЕсли;
	
	Для Каждого ОписаниеОшибкиНастройки Из РезультатПроверки.ОшибкиНастроекСхемы Цикл
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			ОписаниеОшибкиНастройки,,,
			"Схема");
	КонецЦикла;
	
	ПоказатьПредупреждение(, РезультатПроверки.ОписаниеРезультата);
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьТочныеСрокиПоСхеме(Команда)
	
	Если Не Объект.Стартован
		И Не Объект.ПометкаУдаления Тогда
		
		// Рассчитываем сроки в карточке, если процесс не стартован.
		
		Если СрокиИсполненияПроцессовКлиентСерверКОРП.КомандаРасчетаСрокаДоступна(ЭтаФорма) Тогда
			ДатаОтсчетаДляРасчетаСроков = ТекущаяДата();
		КонецЕсли;
		
		ОбновитьСрокиИсполненияНаСервере();
		
		ПоказатьПредупреждение(, НСтр("ru = 'Расчет сроков завершен.'"));
		
	ИначеЕсли Объект.Стартован
		И Не Объект.ПометкаУдаления
		И Объект.Состояние = ПредопределенноеЗначение(
			"Перечисление.СостоянияБизнесПроцессов.Остановлен") Тогда
		
		// Иначе рассчитываем сроки и фиксируем в текущем и подчиненных действиях.
		
		РезультатРассчета = РассчитатьТочныеСрокиПоСхемеНаСервере();
		
		ОписаниеОповещения = Новый ОписаниеОповещения(
			"ЗавершитьРасчетТочныхСроковПоСхеме",
			ЭтотОбъект,
			РезультатРассчета.АдресХранилищаСРассчитаннымиСроками);
			
		// Проверяем и запрашиваем подтверждение преноса сроков
		// подчиненных процессов.
		Если РезультатРассчета.СрокиПроцессовИзменены Тогда
			
			ПараметрыФормы = Новый Структура;
			
			ПараметрыФормы.Вставить(
				"АдресХранилищаСРассчитаннымиСроками", РезультатРассчета.АдресХранилищаСРассчитаннымиСроками);
			
			ПараметрыФормы.Вставить(
				"ЗапрашиватьПричинуПереносаСроков", ВестиУчетПереносаСроков);
			
			ОткрытьФорму("ОбщаяФорма.ПодтверждениеПереносаСрока", ПараметрыФормы, ЭтаФорма,,,,
				ОписаниеОповещения,
				РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			
			Возврат;
		КонецЕсли;
		
		ВыполнитьОбработкуОповещения(ОписаниеОповещения, "");
		
	Иначе
		// Других сценариев расчета и обновления сроков не предусмотрено.
	КонецЕсли;
	
КонецПроцедуры

// Продолжение РассчитатьТочныеСрокиПоСхеме.
//
&НаКлиенте
Процедура ЗавершитьРасчетТочныхСроковПоСхеме(
	ПричинаПереносаСрока, АдресХранилищаСРассчитаннымиСроками) Экспорт
	
	Если ПричинаПереносаСрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СрокиИсполненияПроцессовКлиентКОРП.ЗаписатьРассчитанныеТочныеСрокиПоСхеме(
		ПричинаПереносаСрока, АдресХранилищаСРассчитаннымиСроками, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПроцессДействияСхемы(Команда)
	
	СтрокаПараметровДействия = РаботаСКомплекснымиБизнесПроцессамиКлиентСервер.СтрокаПараметровДействий(
		СхемаКомплексногоПроцесса, ИмяТекущегоЭлементаСхемыПроцесса);
	Если СтрокаПараметровДействия = Неопределено
		Или Не ЗначениеЗаполнено(СтрокаПараметровДействия.Процесс) Тогда
		
		Возврат;
	КонецЕсли;
	
	СтрокаЭлементаСхемы = РаботаСКомплекснымиБизнесПроцессамиКлиентСервер.СтрокаЭлементаСхемы(
		СхемаКомплексногоПроцесса, ИмяТекущегоЭлементаСхемыПроцесса);
	Если СтрокаЭлементаСхемы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РаботаСКомплекснымиБизнесПроцессамиКлиент.ОткрытьПроцессДействия(
		ЭтаФорма, СтрокаПараметровДействия.Процесс, СтрокаЭлементаСхемы.Пройден);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьШаблонДействияСхемы(Команда)
	
	СтрокаПараметровДействия = РаботаСКомплекснымиБизнесПроцессамиКлиентСервер.СтрокаПараметровДействий(
		СхемаКомплексногоПроцесса, ИмяТекущегоЭлементаСхемыПроцесса);
	Если СтрокаПараметровДействия = Неопределено
		Или Не ЗначениеЗаполнено(СтрокаПараметровДействия.ШаблонПроцесса) Тогда
		
		Возврат;
	КонецЕсли;
	
	РаботаСКомплекснымиБизнесПроцессамиКлиент.ОткрытьШаблонДействия(
		ЭтаФорма, СтрокаПараметровДействия.ШаблонПроцесса);
	
КонецПроцедуры

&НаКлиенте
Процедура ПрерватьДействиеСхемы(Команда)
	
	РаботаСКомплекснымиБизнесПроцессамиКлиент.ОбновитьПризнакПрерыванияДляДействияСхемы(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ТекущаяПозицияСхемы(Команда)
	
	РаботаСКомплекснымиБизнесПроцессамиКлиент.ОбновитьПризнакТекущегоЭлементаСхемы(ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы_ДеревоПроцессовИЗадач

&НаКлиенте
Процедура ЖелтыйФлаг(Команда)
	
	РаботаСБизнесПроцессамиКлиент.УстановитьФлаги(
		ЭтаФорма,
		ПредопределенноеЗначение("Перечисление.ФлагиОбъектов.Желтый"),
		"ДеревоЗадач");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗеленыйФлаг(Команда)
	
	РаботаСБизнесПроцессамиКлиент.УстановитьФлаги(
		ЭтаФорма,
		ПредопределенноеЗначение("Перечисление.ФлагиОбъектов.Зеленый"),
		"ДеревоЗадач");
	
КонецПроцедуры

&НаКлиенте
Процедура КрасныйФлаг(Команда)
	
	РаботаСБизнесПроцессамиКлиент.УстановитьФлаги(
		ЭтаФорма,
		ПредопределенноеЗначение("Перечисление.ФлагиОбъектов.Красный"),
		"ДеревоЗадач");
	
КонецПроцедуры

&НаКлиенте
Процедура ЛиловыйФлаг(Команда)
	
	РаботаСБизнесПроцессамиКлиент.УстановитьФлаги(
		ЭтаФорма,
		ПредопределенноеЗначение("Перечисление.ФлагиОбъектов.Лиловый"),
		"ДеревоЗадач");
	
КонецПроцедуры

&НаКлиенте
Процедура ОранжевыйФлаг(Команда)
	
	РаботаСБизнесПроцессамиКлиент.УстановитьФлаги(
		ЭтаФорма,
		ПредопределенноеЗначение("Перечисление.ФлагиОбъектов.Оранжевый"),
		"ДеревоЗадач");
	
КонецПроцедуры

&НаКлиенте
Процедура СинийФлаг(Команда)
	
	РаботаСБизнесПроцессамиКлиент.УстановитьФлаги(
		ЭтаФорма,
		ПредопределенноеЗначение("Перечисление.ФлагиОбъектов.Синий"),
		"ДеревоЗадач");
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьФлаг(Команда)
	
	РаботаСБизнесПроцессамиКлиент.УстановитьФлаги(
		ЭтаФорма,
		Неопределено,
		"ДеревоЗадач");
	
КонецПроцедуры

&НаКлиенте
Процедура СписокАктивныхЗадачЖелтыйФлаг(Команда)
	
	РаботаСБизнесПроцессамиКлиент.УстановитьФлаги(
		ЭтаФорма,
		ПредопределенноеЗначение("Перечисление.ФлагиОбъектов.Желтый"),
		"СписокАктивныхЗадач");
	
КонецПроцедуры

&НаКлиенте
Процедура СписокАктивныхЗадачЗеленыйФлаг(Команда)
	
	РаботаСБизнесПроцессамиКлиент.УстановитьФлаги(
		ЭтаФорма,
		ПредопределенноеЗначение("Перечисление.ФлагиОбъектов.Зеленый"),
		"СписокАктивныхЗадач");
	
КонецПроцедуры

&НаКлиенте
Процедура СписокАктивныхЗадачКрасныйФлаг(Команда)
	
	РаботаСБизнесПроцессамиКлиент.УстановитьФлаги(
		ЭтаФорма,
		ПредопределенноеЗначение("Перечисление.ФлагиОбъектов.Красный"),
		"СписокАктивныхЗадач");
	
КонецПроцедуры

&НаКлиенте
Процедура СписокАктивныхЗадачЛиловыйФлаг(Команда)
	
	РаботаСБизнесПроцессамиКлиент.УстановитьФлаги(
		ЭтаФорма,
		ПредопределенноеЗначение("Перечисление.ФлагиОбъектов.Лиловый"),
		"СписокАктивныхЗадач");
	
КонецПроцедуры

&НаКлиенте
Процедура СписокАктивныхЗадачОранжевыйФлаг(Команда)
	
	РаботаСБизнесПроцессамиКлиент.УстановитьФлаги(
		ЭтаФорма,
		ПредопределенноеЗначение("Перечисление.ФлагиОбъектов.Оранжевый"),
		"СписокАктивныхЗадач");
	
КонецПроцедуры

&НаКлиенте
Процедура СписокАктивныхЗадачОчиститьФлаг(Команда)
	
	РаботаСБизнесПроцессамиКлиент.УстановитьФлаги(
		ЭтаФорма,
		Неопределено,
		"СписокАктивныхЗадач");
	
КонецПроцедуры

&НаКлиенте
Процедура СписокАктивныхЗадачСинийФлаг(Команда)
	
	РаботаСБизнесПроцессамиКлиент.УстановитьФлаги(
		ЭтаФорма,
		ПредопределенноеЗначение("Перечисление.ФлагиОбъектов.Синий"),
		"СписокАктивныхЗадач");
	
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	
	ОбновитьДеревоПроцессовЗадач();
	
КонецПроцедуры

&НаКлиенте
Процедура НайтиВДеревеЗадач(Команда)
	
	Если Элементы.СписокАктивныхЗадач.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НайтиВДеревеЗадачНаСервере(Элементы.СписокАктивныхЗадач.ТекущиеДанные.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиКТекущемуОбъекту(Команда)
	
	РаботаСБизнесПроцессамиКлиент.ПерейтиКТекущемуОбъекту(Объект.Ссылка, ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Выводит диалог выбора варианта редактирования маршрута комплексного процесса/шаблона.
//
&НаКлиенте
Процедура ВыбратьВариантРедактированияМаршрута()
	
	ОписаниеОповещения = Новый ОписаниеОповещения(
		"ЗавершитьВыборВариантРедактированияМаршрута", ЭтотОбъект);
	
	РаботаСКомплекснымиБизнесПроцессамиКлиент.ВыбратьВариантРедактированияМаршрута(ЭтаФорма, ОписаниеОповещения);
	
КонецПроцедуры

// Продолжение ВыбратьВариантРедактированияМаршрута.
//
&НаКлиенте
Процедура ЗавершитьВыборВариантРедактированияМаршрута(Результат, ДополнительныеПараметры) Экспорт
	
	РаботаСКомплекснымиБизнесПроцессамиКлиент.НастроитьДоступностьКомандНастройкиЭлементов(ЭтаФорма);
	
	НастроитьДоступностьРедактированияСхемы(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура УдалитьЭтапы()
	
	Для Каждого ЭтапКУдалению Из ЭтапыКУдалению Цикл 
		РаботаСКомплекснымиБизнесПроцессамиСервер.УдалитьЭтап(
			ЭтаФорма, 
			ЭтапКУдалению.Значение.ЗадачаЭтапа, 
			ЭтапКУдалению.Значение.ИдентификаторЭтапа);
	КонецЦикла;		
		
	ЭтапыУдалениеСервер();	
	
КонецПроцедуры

&НаСервере
Процедура ПослеУдаленияДействия()
	
	РаботаСКомплекснымиБизнесПроцессамиСервер.ЗаполнитьВычисляемыеПоляЭтапов(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ЭтапыУдалениеСервер()
	
	РаботаСКомплекснымиБизнесПроцессамиСервер.ЗаполнитьВычисляемыеПоляЭтапов(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоШаблонуНаСервере(Шаблон) 
	
	БизнесПроцессОбъект = РеквизитФормыВЗначение("Объект");
	
	ИсходныеПредметы = Объект.Предметы.Выгрузить();
	
	Мультипредметность.ЗаполнитьПредметыПроцессаПоШаблону(Шаблон, БизнесПроцессОбъект);
	БизнесПроцессОбъект.ЗаполнитьДействияПоШаблону(Шаблон);
	Мультипредметность.ПередатьПредметыПроцессу(БизнесПроцессОбъект, ИсходныеПредметы, Ложь, Истина);
	БизнесПроцессОбъект.ЗаполнитьПоШаблону(Шаблон);
	
	ЗначениеВРеквизитФормы(БизнесПроцессОбъект, "Объект");
	МультипредметностьКлиентСервер.ЗаполнитьТаблицуПредметовФормы(Объект);
	Мультипредметность.ОбработатьОписаниеПредметовПроцесса(Объект);
	
	Если ЗначениеЗаполнено(БизнесПроцессОбъект.Схема) Тогда
		РаботаСКомплекснымиБизнесПроцессамиСервер.ИнициализироватьСхемуПроцесса(ЭтаФорма, БизнесПроцессОбъект);
		РаботаСКомплекснымиБизнесПроцессамиКлиентСервер.НастроитьЭлементыРедактированияМаршрута(ЭтаФорма);
	Иначе
		РаботаСКомплекснымиБизнесПроцессамиСервер.ЗаполнитьВычисляемыеПоляЭтапов(ЭтаФорма);
	КонецЕсли;
	
	УстановитьДоступность();
	УстановитьДоступностьПоШаблону();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступность()
	
	ПравоНаИзменение = Истина;
	Если НЕ Объект.Ссылка.Пустая() Тогда
		ПраваПоОбъекту = ДокументооборотПраваДоступа.ПолучитьПраваПоОбъекту(Объект.Ссылка);
		ПравоНаИзменение = ПраваПоОбъекту.Изменение;
	КонецЕсли;
	
	ЭтотУзел = РаботаСБизнесПроцессами.ЭтотУзелОбменаДляОбработкиПроцессов();
	
	Если Объект.Завершен
		Или Не ПравоНаИзменение
		Или (ЗначениеЗаполнено(Объект.Ссылка) И ЭтотУзел <> Объект.УзелОбмена) Тогда
		
		ЭтаФорма.ТолькоПросмотр = Истина;
		Элементы.ФормаСтартИЗакрыть.Доступность = Ложь;
		Элементы.ФормаЗаписатьИЗакрыть.Доступность = Ложь;
		Элементы.ФормаОстановить.Доступность = Ложь;
		Элементы.ФормаПродолжитьБизнесПроцесс.Доступность = Ложь;
		Элементы.ФормаПрервать.Доступность = Ложь;
		Элементы.ЭтапыПредшественникиЭтапаСтрокой.Доступность = Ложь;
		Элементы.ВариантМаршрутизации.Доступность = Ложь;
		Элементы.Контролер.ТолькоПросмотр = ТолькоПросмотр;
	КонецЕсли;
	
	Элементы.ГруппаИнфо.Видимость = Объект.Стартован;
	Элементы.ГлавнаяЗадача.Видимость = ЗначениеЗаполнено(Объект.ГлавнаяЗадача);
	Элементы.ФормаУстановитьГлавнуюЗадачу.Видимость = НЕ ЗначениеЗаполнено(Объект.ВедущаяЗадача);
	
	Если Объект.Стартован Тогда
		Элементы.ФормаЗаполнитьПоШаблону.Видимость = Ложь;
		Элементы.ЭтапыПереместитьВверх.Доступность = Ложь;
		Элементы.ЭтапыПереместитьВниз.Доступность = Ложь;
		Элементы.ЭтапыКонтекстноеМенюПереместитьВверх.Доступность = Ложь;
		Элементы.ЭтапыКонтекстноеМенюПереместитьВниз.Доступность = Ложь;
		Элементы.ВариантМаршрутизации.Доступность = Ложь;
		
		Если Объект.Состояние = Перечисления.СостоянияБизнесПроцессов.Прерван Тогда
			РаботаСБизнесПроцессамиВызовСервера.ОтобразитьНаФормеПричинуПрерывания(ЭтаФорма);
		КонецЕсли;
		
		Элементы.ФормаСтартИЗакрыть.Доступность = Ложь;
		
	Иначе
		Элементы.ФормаОстановить.Видимость = Ложь;
		Элементы.ФормаПродолжитьБизнесПроцесс.Видимость = Ложь;
		Элементы.ФормаПрервать.Видимость = Ложь;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.ВедущаяЗадача) Тогда
		Элементы.ФормаОстановить.Видимость = Ложь;
		Элементы.ФормаПродолжитьБизнесПроцесс.Видимость = Ложь;
		Элементы.ФормаПрервать.Видимость = Ложь;
	КонецЕсли;
	
	Элементы.ФормаПометитьНаУдаление.Доступность =
		РаботаСБизнесПроцессамиВызовСервера.ПроверитьДоступностьПометкиУдаленияБизнесПроцесса(Объект.Ссылка);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьПоШаблону()
	
	ДоступностьПоШаблону = Истина;
	
	Если Не ЗначениеЗаполнено(Объект.Шаблон) И Не ЗначениеЗаполнено(Объект.ВедущаяЗадача) Тогда 
		Возврат;
	КонецЕсли;
	
	ДоступностьПоШаблону = ШаблоныБизнесПроцессов.ДоступностьПоШаблону(Объект);
	
	Если ЗначениеЗаполнено(Объект.Контролер) Тогда 
		Элементы.Контролер.ТолькоПросмотр = Не ДоступностьПоШаблону;
	Иначе
		Элементы.Контролер.ТолькоПросмотр = Ложь;
	КонецЕсли;
	Элементы.Контролер.ТолькоПросмотр = Элементы.Контролер.ТолькоПросмотр ИЛИ ТолькоПросмотр;
	
	Если ИспользоватьСхемуПроцесса Тогда
		НастроитьДоступностьРедактированияСхемы(ЭтаФорма);
	Иначе
		Если Объект.Этапы.Количество() > 0 Тогда
			Элементы.Этапы.ТолькоПросмотр = Не ДоступностьПоШаблону;
			Элементы.ЭтапыДобавить.Доступность = ДоступностьПоШаблону;
			Элементы.ЭтапыКонтекстноеМенюДобавить.Доступность = ДоступностьПоШаблону;
			Элементы.НастроитьДействие.Доступность = ДоступностьПоШаблону;
			Элементы.КонтекстноеМенюНастроитьДействие.Доступность = ДоступностьПоШаблону;
			Элементы.ВариантМаршрутизации.ТолькоПросмотр = Не ДоступностьПоШаблону
		Иначе
			Элементы.Этапы.ТолькоПросмотр = Ложь;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьЗавершениеЗадачи(Задача)
	
	Если Не ИспользоватьСхемуПроцесса Тогда
		СрокиЭтапов = СрокиИсполненияПроцессов.СрокиДействийПроцесса(Объект.Этапы, "ИдентификаторЭтапа");
	КонецЕсли;
	
	Прочитать();
	
	Если Не ИспользоватьСхемуПроцесса Тогда
		
		РаботаСКомплекснымиБизнесПроцессамиСервер.ЗаполнитьВычисляемыеПоляЭтапов(ЭтаФорма, Ложь);
		
		СрокиИсполненияПроцессов.ЗаполнитьСрокиВТаблицеДействий(СрокиЭтапов, Объект.Этапы, "ИдентификаторЭтапа");
		
	КонецЕсли;
	
	ЗаполнитьДатыЗавершенияЭтапов();
	ОбновитьПризнакиИстекшихСроков();
	
КонецПроцедуры

&НаСервере
Функция СкопироватьШаблонВНастройкиПроцессаИПолучитьИмяФормы(ШаблонБП, ВладелецШаблона) 

	Если ТипЗнч(ВладелецШаблона) = Тип("БизнесПроцессСсылка.КомплексныйПроцесс") Тогда
		//Развернем автоподстановки из шаблона в реальных исполнителей
		ИмяПроцесса = Справочники[ШаблонБП.Метаданные().Имя].ИмяПроцесса(ШаблонБП);
		БизнесПроцессОбъект = БизнесПроцессы[ИмяПроцесса].СоздатьБизнесПроцесс();
		
		БизнесПроцессОбъект.Дата = ТекущаяДатаСеанса();
		БизнесПроцессОбъект.Автор = Объект.Автор;
		
		Мультипредметность.ЗаполнитьПредметыПроцессаПоШаблону(ШаблонБП, БизнесПроцессОбъект);
		
		Если МультипредметностьКлиентСервер.ЭтоКомплексныйПроцесс(БизнесПроцессОбъект) Тогда
			БизнесПроцессОбъект.ЗаполнитьДействияПоШаблону(ШаблонБП);
		КонецЕсли;
		
		Мультипредметность.ПередатьПредметыПроцессу(БизнесПроцессОбъект, Объект.Предметы);
		
		БизнесПроцессОбъект.ЗаполнитьПоШаблону(ШаблонБП);
		
		ШаблонДляВставки = БизнесПроцессОбъект.СоздатьШаблонПоПроцессу();
		
		ШаблонДляВставкиОбъект = ШаблонДляВставки.ПолучитьОбъект();
		
	Иначе
		
		ШаблонДляВставкиОбъект = ШаблонБП.Скопировать();
		
	КонецЕсли;
	
	ШаблонДляВставкиОбъект.ВладелецШаблона = ВладелецШаблона;
	ШаблонДляВставкиОбъект.ШаблонВКомплексномПроцессе = Истина;
	
	Если ВладелецШаблона.Важность = Перечисления.ВариантыВажностиЗадачи.Высокая
		ИЛИ ВладелецШаблона.Важность = Перечисления.ВариантыВажностиЗадачи.Низкая Тогда
		ШаблонДляВставкиОбъект.Важность = ВладелецШаблона.Важность;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	ШаблонДляВставкиОбъект.Записать();
	УстановитьПривилегированныйРежим(Ложь);
	
	ИмяФормыДляОткрытия = ШаблонДляВставки.Метаданные().ПолноеИмя() + ".ФормаОбъекта";
	
	ДанныеВозврата = Новый Структура;
	Данныевозврата.Вставить("ИмяФормыДляОткрытия", ИмяФормыДляОткрытия);
	ДанныеВозврата.Вставить("Шаблон", ШаблонДляВставкиОбъект.Ссылка);
	
	ЗаполненыНеобходимыеПоля = УШаблонаДействияЗаполненыВсеНеобходимыеПоля(ШаблонДляВставкиОбъект);
	ДанныеВозврата.Вставить("ЗаполненыНеобходимыеДляСтартаПоля", ЗаполненыНеобходимыеПоля);
	Если ЗаполненыНеобходимыеПоля Тогда
		ПараметрыНастройкиДействия = Новый Структура();
		ПараметрыНастройкиДействия.Вставить("ШаблонБП", ШаблонДляВставкиОбъект.Ссылка);
		ПараметрыНастройкиДействия.Вставить("ВладелецШаблона", Объект.Ссылка);
		ИдентификаторЭтапа = ПрименитьНастройкиДействия(ПараметрыНастройкиДействия);
		ДанныеВозврата.Вставить("ИдентификаторЭтапа", ИдентификаторЭтапа); 
	КонецЕсли;
		
	Возврат ДанныеВозврата;
	
КонецФункции

&НаСервере
Функция СохранитьКакШаблонСервер()
	
	ПроцессОбъект = РеквизитФормыВЗначение("Объект");
	Объект.Шаблон = ПроцессОбъект.СоздатьШаблонПоПроцессу(Объект.Шаблон);	
	Возврат Объект.Шаблон;
	
КонецФункции

&НаСервере
Процедура УстановитьВажностьВсехЭтапов(ВажностьЭтапов)
	
	Если Объект.Ссылка.Пустая() Тогда
		Если Не Записать() Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если ИспользоватьСхемуПроцесса Тогда
		Справочники.СхемыКомплексныхПроцессов.УстановитьВажностьШаблонамПроцессов(
			СхемаКомплексногоПроцесса, ВажностьЭтапов);
	Иначе
		Для Каждого Этап Из Объект.Этапы Цикл
			ШаблонОбъект = Этап.ШаблонБизнесПроцесса.ПолучитьОбъект();
			ШаблонОбъект.Важность = ВажностьЭтапов;
			ШаблонОбъект.Записать();
		КонецЦикла;
		РаботаСКомплекснымиБизнесПроцессамиСервер.ЗаполнитьВычисляемыеПоляЭтапов(ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьИмяФормыДляОткрытияДействия(Ссылка)
	
	Возврат Ссылка.Метаданные().ПолноеИмя() + ".ФормаОбъекта";
	
КонецФункции

&НаСервере
Функция ПрименитьНастройкиДействия(Параметр)
	
	Результат = РаботаСКомплекснымиБизнесПроцессамиСервер.ПрименитьНастройкиДействия(ЭтаФорма, Параметр);
	РеквизитСИзмененнымСроком = "Этапы";
	ИдентификаторыИзмененныхДействий.Добавить(Результат);
	ВариантМаршрутизацииПриИзмененииСервер();
	Возврат Результат;
		
КонецФункции

&НаСервере
Процедура ВариантМаршрутизацииПриИзмененииСервер()
	
	// Получаем текущие рассичитанные сроки этапов
	СрокиЭтапов = СрокиИсполненияПроцессов.СрокиДействийПроцесса(Объект.Этапы, "ИдентификаторЭтапа");
	
	ОбъектФормы = РеквизитФормыВЗначение("Объект");
	РаботаСКомплекснымиБизнесПроцессамиСервер.ВариантМаршрутизацииПриИзменении(ОбъектФормы, ЭтапыКУдалению);
	ЗначениеВРеквизитФормы(ОбъектФормы, "Объект");
	Для Каждого Этап Из Объект.Этапы Цикл
		Для Каждого ЭтапКУдалению Из ЭтапыКУдалению Цикл
			Если Этап.ИдентификаторЭтапа = ЭтапКУдалению.Значение.ИдентификаторЭтапа Тогда
				Этап.Удален = истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	МультипредметностьКлиентСервер.ЗаполнитьТаблицуПредметовФормы(Объект);
	Мультипредметность.ОбработатьОписаниеПредметовПроцесса(Объект);
	РаботаСКомплекснымиБизнесПроцессамиСервер.ЗаполнитьВычисляемыеПоляЭтапов(ЭтаФорма);
	
	СрокиИсполненияПроцессов.ЗаполнитьСрокиВТаблицеДействий(СрокиЭтапов, Объект.Этапы, "ИдентификаторЭтапа");
	
	ОчиститьДатуОтсчетаДляРасчетаСроков(ЭтаФорма);
	ОбновитьСрокиИсполненияНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьДанныеПроекта()
	
	ЕдиницаТрудозатрат = Константы.ОсновнаяЕдиницаТрудозатрат.Получить();
	Если ПолучитьФункциональнуюОпцию("ВестиУчетПоПроектам") Тогда 
		ПроектЗадача = РаботаСПроектамиКлиентСервер.ПредставлениеПроектаЗадачи(Объект.Проект, Объект.ПроектнаяЗадача);	
		Если ЗначениеЗаполнено(Объект.ПроектнаяЗадача) Тогда 
			ЕдиницаТрудозатрат = ОбщегоНазначенияДокументооборот.ЗначениеРеквизитаОбъектаВПривилегированномРежиме(
				Объект.ПроектнаяЗадача, "ТекущийПланЕдиницаТрудозатрат");
		ИначеЕсли ЗначениеЗаполнено(Объект.Проект) Тогда 
			ЕдиницаТрудозатрат = ОбщегоНазначенияДокументооборот.ЗначениеРеквизитаОбъектаВПривилегированномРежиме(
				Объект.Проект, "ЕдиницаТрудозатратЗадач");
		КонецЕсли;
	КонецЕсли;
	
	ЗаполнитьОписаниеТрудозатрат(ЭтаФорма);
	
КонецПроцедуры	

&НаКлиенте
Процедура ИзменитьДействиеКлиент()
	
	ТекущиеДанные = Элементы.Этапы.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не РаботаСКомплекснымиБизнесПроцессамиКлиент.
		ЗаписатьНовыйПроцессПередДобавлениемДействия(ЭтаФорма) Тогда
		
		Возврат;
	КонецЕсли;
	
	Если Объект.Стартован Тогда
		
		Если Модифицированность И Не Записать() Тогда
			Возврат;
		КонецЕсли;
		
		РазблокироватьДанныеФормыДляРедактирования();
	КонецЕсли;
	ПараметрыФормы = Новый Структура;
	Если ЗначениеЗаполнено(ТекущиеДанные.ЗапущенныйБизнесПроцесс) И НЕ ТекущиеДанные.ЗадачаВыполнена Тогда
		ПараметрыФормы.Вставить("Ключ", ТекущиеДанные.ЗапущенныйБизнесПроцесс);
		ПараметрыФормы.Вставить("ЗаявкаНаПереносСрока", ЗаявкаНаПереносСрока);
		ИмяФормыДляОткрытия = ПолучитьИмяФормыДляОткрытияДействия(ТекущиеДанные.ЗапущенныйБизнесПроцесс);
		ОткрытьФорму(ИмяФормыДляОткрытия, ПараметрыФормы, ЭтаФорма);
	ИначеЕсли ЗначениеЗаполнено(ТекущиеДанные.ЗапущенныйБизнесПроцесс) И ТекущиеДанные.ЗадачаВыполнена Тогда
		ПараметрыФормы.Вставить("Ключ", ТекущиеДанные.ЗапущенныйБизнесПроцесс);
		ИмяФормыДляОткрытия = ПолучитьИмяФормыДляОткрытияДействия(ТекущиеДанные.ЗапущенныйБизнесПроцесс);
		ОткрытьФорму(ИмяФормыДляОткрытия, ПараметрыФормы, ЭтаФорма);	
	Иначе
		ВыполнитьНастройкуДействия(ТекущиеДанные);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьНастройкуДействия(ТекущиеДанные)
	
	ИмяФормыДляОткрытия = ПолучитьИмяФормыДляНастройкиДействия(ТекущиеДанные.ШаблонБизнесПроцесса);
	Если Не ЗначениеЗаполнено(ИмяФормыДляОткрытия) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Ключ", ТекущиеДанные.ШаблонБизнесПроцесса);
	Если ЗначениеЗаполнено(Объект.Автор) Тогда
		ПараметрыФормы.Вставить("ТолькоПросмотр", Не ДоступностьПоШаблону И ЗначениеЗаполнено(Объект.Шаблон));
	КонецЕсли;
	Предметы = Новый Массив;
	Для Каждого СтрокаПредмет Из Объект.Предметы Цикл
		Предметы.Добавить(СтрокаПредмет.Предмет);
	КонецЦикла;
	Если Предметы.Количество() > 0 Тогда
		ПараметрыФормы.Вставить("ПредметыПроцесса", Предметы);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДатаОтсчетаДляРасчетаСроков) Тогда
		ДатаОтсчета = СрокиИсполненияПроцессовКлиентСерверКОРП.
			ДатаОтсчетаДействияКомплексногоПроцессаВФорме(ЭтаФорма);
		ПараметрыФормы.Вставить("ДатаОтсчетаДляРасчетаСроков", ДатаОтсчета);
	КонецЕсли;
	
	ОткрытьФорму(ИмяФормыДляОткрытия, ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры

&НаСервереБезКонтекста	
Функция УШаблонаДействияЗаполненыВсеНеобходимыеПоля(ШаблонОбъект) 
	
	Возврат ШаблонОбъект.ПолучитьСписокНезаполненныхПолейНеобходимыхДляСтарта().Количество() = 0;
	
КонецФункции

&НаКлиенте
Функция ПолучитьИмяФормыДляНастройкиДействия(Действие)
	
	Если ТипЗнч(Действие) = Тип("СправочникСсылка.ШаблоныИсполнения") Тогда
		Возврат "Справочник.ШаблоныИсполнения.ФормаОбъекта";
	ИначеЕсли ТипЗнч(Действие) = Тип("СправочникСсылка.ШаблоныКомплексныхБизнесПроцессов") Тогда
		Возврат "Справочник.ШаблоныКомплексныхБизнесПроцессов.ФормаОбъекта";
	ИначеЕсли ТипЗнч(Действие) = Тип("СправочникСсылка.ШаблоныОзнакомления") Тогда
		Возврат "Справочник.ШаблоныОзнакомления.ФормаОбъекта";
	ИначеЕсли ТипЗнч(Действие) = Тип("СправочникСсылка.ШаблоныПоручения") Тогда
		Возврат "Справочник.ШаблоныПоручения.ФормаОбъекта";
	ИначеЕсли ТипЗнч(Действие) = Тип("СправочникСсылка.ШаблоныПриглашения") Тогда
		Возврат "Справочник.ШаблоныПриглашения.ФормаОбъекта";
	ИначеЕсли ТипЗнч(Действие) = Тип("СправочникСсылка.ШаблоныРассмотрения") Тогда
		Возврат "Справочник.ШаблоныРассмотрения.ФормаОбъекта";
	ИначеЕсли ТипЗнч(Действие) = Тип("СправочникСсылка.ШаблоныРегистрации") Тогда
		Возврат "Справочник.ШаблоныРегистрации.ФормаОбъекта";
	ИначеЕсли ТипЗнч(Действие) = Тип("СправочникСсылка.ШаблоныСогласования") Тогда
		Возврат "Справочник.ШаблоныСогласования.ФормаОбъекта";
	ИначеЕсли ТипЗнч(Действие) = Тип("СправочникСсылка.ШаблоныСоставныхБизнесПроцессов") Тогда
		Возврат "Справочник.ШаблоныСоставныхБизнесПроцессов.ФормаОбъекта";
	ИначеЕсли ТипЗнч(Действие) = Тип("СправочникСсылка.ШаблоныУтверждения") Тогда
		Возврат "Справочник.ШаблоныУтверждения.ФормаОбъекта";
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

&НаКлиенте
Процедура ОбновитьОписаниеПредметов()
	
	МультипредметностьКлиент.ОбновитьОписаниеПредметов(Объект);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДоступностьЭлементовФормыПоСостояниюПроцесса(ПрочитатьПараметрыСостояния = Ложь) Экспорт
	
	Если ПрочитатьПараметрыСостояния Тогда
		Прочитать();
		СтартПроцессовСервер.ЗаполнитьНастройкиСтартаВФормеПроцесса(ЭтаФорма);
	КонецЕсли;
	
	РаботаСБизнесПроцессамиВызовСервера.ОбновитьДоступностьЭлементовФормыПоСостояниюПроцесса(
		ЭтаФорма, Не ИспользоватьСхемуПроцесса);
	
	// Настроим доступность редактирование схемы.
	НастроитьДоступностьРедактированияСхемы(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Функция ЭлементыДляСохранения()
	
	СохраняемыеЭлементы = Новый Структура("Контролер", Объект.Контролер);
	
	Возврат СохранениеВводимыхЗначений.СформироватьТаблицуСохраняемыхЭлементов(СохраняемыеЭлементы);
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ИНСТРУКЦИИ

&НаСервере
Процедура ПолучитьИнструкции()
	
	РаботаСИнструкциями.ПолучитьИнструкции(ЭтаФорма, 75, 100);
	
КонецПроцедуры

&НаКлиенте
Процедура ИнструкцияПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	РаботаСИнструкциямиКлиент.ОткрытьСсылку(ДанныеСобытия.Href, ДанныеСобытия.Element, Элемент.Документ);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказыватьИнструкции(Команда)
	
	ПоказыватьИнструкции = Не ПоказыватьИнструкции;
	ПолучитьИнструкции();
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьОписаниеТрудозатрат(Форма)
	
	Если НЕ Форма.ВестиУчетПлановыхТрудозатратВБизнесПроцессах Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыОписания = Новый Структура;
	ПараметрыОписания.Вставить("Контролер", Истина);
	
	РаботаСБизнесПроцессамиКлиентСервер.ЗаполнитьОписаниеТрудозатрат(Форма, ПараметрыОписания);
	
КонецПроцедуры

&НаСервере
Функция ПредставлениеРезультата() Экспорт
	
	ПредставлениеРезультата = НСтр("ru = 'Завершен %1'");
	
	Возврат СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		ПредставлениеРезультата, Формат(Объект.ДатаЗавершения, "ДФ='dd.MM.yyyy HH:mm'"));
	
КонецФункции

// Конец СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки

// СтандартныеПодсистемы.БазоваяФункциональность
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции_ПроверкаЗаполненияПроцесса

// Проверяет заполнение процесса перед стартом на клиенте.
//
// Параметры:
//  - Отказ  - Булево - принимает значение Истина, если имеются ошибки заполнения.
//
&НаКлиенте
Процедура ПроверитьЗаполнениеПроцессаПередСтартом(Отказ)
	
	МультипредметностьКлиент.ПроверитьЗаполнениеПредметовПроцесса(ЭтаФорма, Отказ);
	// Проверка на корректность заполнения перед стартом
	Если НЕ ЗначениеЗаполнено(Объект.Наименование) Тогда
		Текст = НСтр("ru = 'Не заполнено поле ""Наименование"".'");	
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			Текст,
			,
			"Объект.Наименование",
			,
			Отказ);
	КонецЕсли;
	
	Если Не ИспользоватьСхемуПроцесса И Объект.Этапы.Количество() = 0 Тогда
		Текст = НСтр("ru = 'Не указано ни одного действия.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			Текст,
			,
			"Объект.Этапы",
			,
			Отказ);
	КонецЕсли;
	
КонецПроцедуры

// Проверяет заполнение процесса перед записью на сервере.
//
// Параметры:
//  ТекущийОбъект - процесс объект
//  Отказ - Булево - принимает значение Истина, если имеются ошибки заполнения.
//  ТолькоПроверка - Булево - если передается значение Истина, то происходит только проверка
//
&НаСервере
Процедура ПроверитьЗаполнениеПроцессаПередЗаписьюНаСервере(
	Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ЭтоСтарт = (ПараметрыЗаписи.Свойство("Старт") И ПараметрыЗаписи.Старт);
	
	ЭтоОтложенныйСтарт = ПараметрыЗаписи.Свойство("ОтложенныйСтартПроцесса")
		И ПараметрыЗаписи.ОтложенныйСтартПроцесса;
	
	ЭтоФоновыйСтарт = ПараметрыЗаписи.Свойство("ФоновыйСтартПроцесса")
		И ПараметрыЗаписи.ФоновыйСтартПроцесса;
	
	ЭтоПродолжениеПроцесса = ПараметрыЗаписи.Свойство("ИзменениеСостоянияПроцесса")
		И ПараметрыЗаписи.ИзменениеСостоянияПроцесса
		И ПараметрыЗаписи.Свойство("НовоеСостояние")
		И ПараметрыЗаписи.НовоеСостояние = 
			ПредопределенноеЗначение("Перечисление.СостоянияБизнесПроцессов.Активен");
		
	ЭтоИзменениеПроцессаГотовогоКОтложенномуСтарту = 
		Не Объект.Стартован
		И Модифицированность
		И ЗначениеЗаполнено(НастройкаСтарта)
		И НастройкаСтарта.Состояние = 
			ПредопределенноеЗначение("Перечисление.СостоянияПроцессовДляЗапуска.ГотовКСтарту");
	
	// Выполним стандартные обработчики заполнение процесса перед стартом/продолжением.
	Если ЭтоСтарт Или ЭтоОтложенныйСтарт Или ЭтоФоновыйСтарт Или ЭтоПродолжениеПроцесса
		Или ЭтоИзменениеПроцессаГотовогоКОтложенномуСтарту Тогда
		
		Отказ = Не ПроверитьЗаполнение();
	КонецЕсли;
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	// Проверим заполнение этапов процесса перед стартом/продолжением.
	Если Не ИспользоватьСхемуПроцесса
		
		И (ЭтоСтарт Или ЭтоОтложенныйСтарт Или ЭтоФоновыйСтарт
			Или ЭтоИзменениеПроцессаГотовогоКОтложенномуСтарту) Тогда
		
		МассивЭтаповДляЗапуска = Новый Массив();
		Для каждого ЭтапБизнесПроцесса Из ТекущийОбъект.Этапы Цикл
			Если ТекущийОбъект.ЗапускЭтапаПроцессаВозможен(ЭтапБизнесПроцесса, Истина) Тогда
				МассивЭтаповДляЗапуска.Добавить(ЭтапБизнесПроцесса);
			КонецЕсли;
		КонецЦикла;
		Если МассивЭтаповДляЗапуска.Количество() = 0 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				НСтр("ru = 'Старт процесса прерван. Не найдено ни одного действия, подходящего для старта. Необходимо проверить условия и порядок выполнения действий и повторить попытку.'"),,
				"Объект.Этапы",, Отказ);
		КонецЕсли;
		
	КонецЕсли;
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	// Проверка наличия участников процесса среди исполнителей проектной задачи.
	// Проверка правильности указания трудозатрат участников процесса.
	Если ВестиУчетПоПроектам И ЗначениеЗаполнено(ТекущийОбъект.Проект) Тогда
		РаботаСБизнесПроцессамиВызовСервера.ПроверитьСоответствиеПроцессаПроектнойЗадаче(ТекущийОбъект, Отказ);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции_Схема

// Обновляет данные в схеме комплексного процесса (СхемаКомплексногоПроцесса).
//
&НаКлиенте
Процедура ОбновитьДанныеСхемыКомплексногоПроцесса()
	
	Если РассчитыватьОтносительныйСрок(ЭтаФорма) Тогда
		ОчиститьДатуОтсчетаДляРасчетаСроков(ЭтаФорма);
		Если Не ЗначениеЗаполнено(ДатаОтсчетаДляРасчетаСроков) Тогда
			РеквизитСИзмененнымСроком = "Схема";
		КонецЕсли;
	КонецЕсли;
	
	РаботаСКомплекснымиБизнесПроцессамиКлиент.ОбновитьДанныеСхемыКомплексногоПроцесса(ЭтаФорма);
	
КонецПроцедуры

// Восстанавливает фокус текущего элемента в схеме процесса.
//
&НаКлиенте
Процедура ВосстановитьФокусТекущегоЭлементаСхемыПроцесса()
	
	Если ОбщегоНазначенияКлиентСервер.ЭтоВебКлиент() Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИмяТекущегоЭлементаСхемыПроцесса)
		И Элементы.Схема.ТекущийЭлемент = Неопределено Тогда
	
		Элементы.Схема.ТекущийЭлемент = 
			Схема.ЭлементыГрафическойСхемы.Найти(ИмяТекущегоЭлементаСхемыПроцесса);
	КонецЕсли;
	
КонецПроцедуры

// Включает отложенное восстановление фокуса текущего элемента в схеме процесса.
// см. ВосстановитьФокусТекущегоЭлементаСхемыПроцесса
//
&НаКлиенте
Процедура ВосстановитьФокусТекущегоЭлементаСхемыПроцессаОтложенно() Экспорт
	
	ПодключитьОбработчикОжидания("ВосстановитьФокусТекущегоЭлементаСхемыПроцесса", 0.1, Истина);
	
КонецПроцедуры

// Завершает настройку элемента действия в схеме процесса.
//
// Параметры:
//  Шаблон - ОпределяемыйТип.ШаблонДействияКомплексногоПроцессая - ссылка на действие комплексного процесса.
//  Предметы - Массив - массив структур с полями:
//    ИмяПредмета, Предмет, РольПредмета, ИмяПредметаОснование, ШаблонОснование, ИсходноеИмяПредмета (может отсутствовать).
//
&НаКлиенте
Процедура ЗавершитьНастройкуЭлементаСхемыДействия(Шаблон, Предметы)
	
	Если Элементы.Схема.ТекущийЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если РассчитыватьОтносительныйСрок(ЭтаФорма) Тогда
		ОчиститьДатуОтсчетаДляРасчетаСроков(ЭтаФорма);
		Если Не ЗначениеЗаполнено(ДатаОтсчетаДляРасчетаСроков) Тогда
			РеквизитСИзмененнымСроком = "Схема";
		КонецЕсли;
	КонецЕсли;
	
	ПарметрыНовогоШаблона = ЗавершитьНастройкуЭлементаСхемыДействияНаСервере(
		Элементы.Схема.ТекущийЭлемент.Имя, Шаблон, Предметы);
	
	Если ЗначениеЗаполнено(ПарметрыНовогоШаблона.Шаблон)
		И ЗначениеЗаполнено(ПарметрыНовогоШаблона.ИмяФормыДляОткрытия) Тогда
		
		ПараметрыФормы = Новый Структура();
		ПараметрыФормы.Вставить("Ключ", ПарметрыНовогоШаблона.Шаблон);
		ПараметрыФормы.Вставить("ВладелецШаблона", Объект.Ссылка);
		ПараметрыФормы.Вставить("Предметы", Предметы);
		ОткрытьФорму(ПарметрыНовогоШаблона.ИмяФормыДляОткрытия, ПараметрыФормы, ЭтаФорма);
		
	КонецЕсли;
	
	ВосстановитьФокусТекущегоЭлементаСхемыПроцессаОтложенно();
	
КонецПроцедуры

// Завершает настройку элемента действия в схеме процесса на сервере.
// Обертка для функции РаботаСКомплекснымиБизнесПроцессамиСервер.ЗавершитьНастройкуЭлементаСхемыДействия.
//
// Параметры:
//  ИмяДействия - Строка - Имя элемента действия в схеме процесса.
//  Шаблон - ОпределяемыйТип.ШаблонДействияКомплексногоПроцессая - ссылка на действие комплексного процесса.
//  Предметы - Массив - массив структур с полями:
//    ИмяПредмета, Предмет, РольПредмета, ИмяПредметаОснование, ШаблонОснование, ИсходноеИмяПредмета (может отсутствовать).
//
// Возвращаемое значение:
//  см. РаботаСКомплекснымиБизнесПроцессамиСервер.ЗавершитьНастройкуЭлементаСхемыДействия
//
&НаСервере
Функция ЗавершитьНастройкуЭлементаСхемыДействияНаСервере(ИмяДействия, Шаблон, Предметы)
	
	Возврат РаботаСКомплекснымиБизнесПроцессамиСервер.
		ЗавершитьНастройкуЭлементаСхемыДействия(ЭтаФорма, ИмяДействия, Шаблон, Предметы);
	
КонецФункции

// Выполняет проверку корректности схемы.
//
// Возвращаемое значение:
//  Структура
//   * ОписаниеОшибкиНекорректнойСхемы - Структура - см. Справочник.СхемыКомплексныхПроцессов.СхемаКорректна.
//   * ОшибкиНастроекСхемы - Массив - см. Справочники.СхемыКомплексныхПроцессов.ОшибкиЗаполненияНастроекЭлементовСхемы.
//   * ОписаниеРезультата - Строка - описание результата.
//
&НаСервере
Функция ПроверитьСхемуИНастройкиНаСервере() Экспорт
	
	РезультатПроверки = Новый Структура;
	РезультатПроверки.Вставить("ОписаниеОшибкиНекорректнойСхемы", Неопределено);
	РезультатПроверки.Вставить("ОшибкиНастроекСхемы", Неопределено);
	РезультатПроверки.Вставить("ОписаниеРезультата", "");
	
	СсылкаНаОбъект = Объект.Ссылка;
	Если Не ЗначениеЗаполнено(СсылкаНаОбъект) Тогда
		СсылкаНаОбъект = БизнесПроцессы.КомплексныйПроцесс.ПолучитьСсылку(
			Объект.ИдентификаторСсылки);
	КонецЕсли;
	
	// Получим объект схемы из формы.
	СхемаОбъект = 
		РаботаСКомплекснымиБизнесПроцессамиСервер.ОбъектСхемыИзДанныхФормы(ЭтаФорма, СсылкаНаОбъект);
		
	// Проверим корректность самой схемы.
	РезультатПроверки.ОписаниеОшибкиНекорректнойСхемы = СхемаОбъект.СхемаКорректна();
	СхемаКорректна = РезультатПроверки.ОписаниеОшибкиНекорректнойСхемы.НетОшибок;
	
	// Проверим корректность настроек элементов схемы.
	РезультатПроверки.ОшибкиНастроекСхемы = 
		Справочники.СхемыКомплексныхПроцессов.ОшибкиЗаполненияНастроекЭлементовСхемы(СхемаОбъект);
	НетОшибокВНастройках = РезультатПроверки.ОшибкиНастроекСхемы.Количество() = 0;
	
	// Сформируем описание результата.
	Если Не СхемаКорректна Или Не НетОшибокВНастройках Тогда
		РезультатПроверки.ОписаниеРезультата = НСтр("ru = 'Схема не прошла проверку.
			|Исправьте обнаруженные ошибки (см. панель Сообщения).'");
	Иначе
		РезультатПроверки.ОписаниеРезультата = НСтр("ru = 'Схема корректна.'");
	КонецЕсли;
	
	Возврат РезультатПроверки;
	
КонецФункции

// Обрабатывает результат проверки схемы (реквизит РезультатПроверкиСхемыПроцесса).
//
&НаКлиенте
Процедура ОбработатьРезультатПроверкиКорректностиСхемы()
	
	Если РезультатПроверкиКорректностиСхемы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если РезультатПроверкиКорректностиСхемы.НетОшибок Тогда
		РезультатПроверкиКорректностиСхемы = Неопределено;
		Возврат;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
		РезультатПроверкиКорректностиСхемы.ОписаниеОшибки,, "Схема");
	
	Если ЗначениеЗаполнено(РезультатПроверкиКорректностиСхемы.ИмяЭлемента) Тогда
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаМаршрут;
		ИмяТекущегоЭлементаСхемыПроцесса = РезультатПроверкиКорректностиСхемы.ИмяЭлемента;
		ВосстановитьФокусТекущегоЭлементаСхемыПроцессаОтложенно();
	КонецЕсли;
	
	РезультатПроверкиКорректностиСхемы = Неопределено;
	
КонецПроцедуры

// Настраивает доступность редактирования схемы в карточке процесса.
//
// Параметры:
//  Форма - УправляемаяФорма - карточка комплексного процесса.
//
&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьДоступностьРедактированияСхемы(Форма)
	
	Если Не Форма.ИспользоватьСхемуПроцесса Тогда
		Возврат;
	КонецЕсли;
	
	СхемаДоступнаДляРедактирования = Не Форма.ТолькоПросмотр;
	
	Если СхемаДоступнаДляРедактирования Тогда
		
		Если Форма.Объект.Стартован
			И Форма.Объект.Состояние = 
				ПредопределенноеЗначение("Перечисление.СостоянияБизнесПроцессов.Активен") Тогда
			
			СхемаДоступнаДляРедактирования = Ложь
		ИначеЕсли Форма.СхемаКомплексногоПроцесса.ЭлементыСхемы.Количество() > 0 Тогда
			
			СхемаДоступнаДляРедактирования = Форма.ДоступностьПоШаблону;
		КонецЕсли;
		
	КонецЕсли;
	
	Форма.Элементы.ПроверитьСхемуИНастройки.Доступность = СхемаДоступнаДляРедактирования;
	Форма.Элементы.ПроверитьСхемуИНастройкиМенюЕще.Доступность = СхемаДоступнаДляРедактирования;
	
	Форма.Элементы.РассчитатьТочныеСрокиПоСхеме.Доступность = СхемаДоступнаДляРедактирования;
	
	Если ОбщегоНазначенияКлиентСервер.ЭтоВебКлиент() Тогда
		// В веб-клиенте схема не доступна для редактирования.
		Форма.Элементы.Схема.ТолькоПросмотр = Истина;
	Иначе
		Форма.Элементы.Схема.ТолькоПросмотр = Не СхемаДоступнаДляРедактирования;
		Форма.Схема.ИспользоватьСетку = СхемаДоступнаДляРедактирования;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции_ПодсистемаСвойств

&НаКлиенте
Процедура Подключаемый_РедактироватьСоставСвойств()
	
	УправлениеСвойствамиКлиент.РедактироватьСоставСвойств(ЭтаФорма, Объект.Ссылка);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтаФорма,
		РеквизитФормыВЗначение("Объект"));
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
      УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры
 
&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
      УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаСервере
Процедура ДополнительныеОтчетыИОбработкиВыполнитьНазначаемуюКомандуНаСервере(ИмяЭлемента, РезультатВыполнения)
	
	ДополнительныеОтчетыИОбработки.ВыполнитьНазначаемуюКомандуНаСервере(ЭтаФорма, ИмяЭлемента, РезультатВыполнения);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции_Предметы

&НаКлиенте
Процедура ПредметыПредметПриИзменении()
	
	ПредметыПредметПриИзмененииСервер();
	
КонецПроцедуры

&НаСервере
Процедура ПредметыПредметПриИзмененииСервер()
	
	Если ВестиУчетПоПроектам
		И Объект.Проект.Пустая() Тогда
		Для Каждого СтрокаПредмета Из Объект.Предметы Цикл
			Если ЗначениеЗаполнено(СтрокаПредмета.Предмет) 
			 И СтрокаПредмета.РольПредмета = Перечисления.РолиПредметов.Основной
			 И СтрокаПредмета.Предмет.Метаданные().Реквизиты.Найти("Проект") <> Неопределено Тогда 
				ПроектПредмета = ОбщегоНазначенияДокументооборот.
					ЗначениеРеквизитаОбъектаВПривилегированномРежиме(СтрокаПредмета.Предмет, "Проект");
				Если ПроектПредмета <> Объект.Проект Тогда 
					Объект.Проект = ПроектПредмета;
					Объект.ПроектнаяЗадача = Неопределено;
					ПолучитьДанныеПроекта();
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции_ДеревоПроцессовИЗадач

// Обновляет и разворачивает дерево процессов и задач.
//
&НаКлиенте
Процедура ОбновитьДеревоПроцессовЗадач() Экспорт
	
	Если Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаЗадачи Тогда
		ЗаполнитьДеревоПроцессовИЗадач();
		РаботаСБизнесПроцессамиКлиент.РазвернутьДеревоПроцессовИЗадач(ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры

// Заполняет дерево процессов и задач.
//
&НаСервере
Процедура ЗаполнитьДеревоПроцессовИЗадач() Экспорт
	
	РаботаСБизнесПроцессамиВызовСервера.ЗаполнитьПроцессыИЗадачиПоПредмету(ЭтаФорма, Объект.Ссылка);
	КоличествоАктивныхЗадач = СписокАктивныхЗадач.Количество();
	
КонецПроцедуры

// Находит текущую списка СписокАктивныхЗадач в дереве задач.
//
&НаСервере
Процедура НайтиВДеревеЗадачНаСервере(Задача)
	
	ТекущаяСтрокаВДереве = Задача;
	
	РаботаСБизнесПроцессамиКлиентСервер.УстановитьТекущуюСтроку(ДеревоЗадач.ПолучитьЭлементы(), ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции_СрокиИсполненияПроцессов

// Заполняет представление сроков в карточке процесса
//
&НаСервере
Процедура ОбновитьСрокиИсполненияНаСервере() Экспорт
	
	РассчитатьОтносительныйСрок = РассчитыватьОтносительныйСрок(ЭтаФорма);
	РассчитьтатьТочныйСрок = Ложь;
	
	Если Не Объект.Стартован
		И Не Объект.ПометкаУдаления
		И ЗначениеЗаполнено(ДатаОтсчетаДляРасчетаСроков) Тогда
		
		РассчитьтатьТочныйСрок = Истина;
		
	ИначеЕсли Объект.Стартован
		И Не Объект.ПометкаУдаления
		И Объект.Состояние = Перечисления.СостоянияБизнесПроцессов.Активен
		И ЗначениеЗаполнено(РеквизитСИзмененнымСроком) Тогда
		
		РассчитьтатьТочныйСрок = Истина;
	КонецЕсли;
	
	Смещение = СрокиИсполненияПроцессовКлиентСерверКОРП.СмещенияДатыОтсчетаВКарточке(ЭтаФорма);
	
	Если РассчитатьОтносительныйСрок Тогда
		
		Если ИспользоватьСхемуПроцесса Тогда
			
			СрокиИсполненияПроцессовКлиентСерверКОРП.
				ЗаполнитьСрокиВПараметрахДействийСхемыКомплексногоПроцесса(
					СхемаКомплексногоПроцесса.ПараметрыДействий,
					СхемаКомплексногоПроцесса.ЭлементыСхемы,
					КэшДанныхДействий);
				
			ДлительностьИсполнения = СрокиИсполненияПроцессов.ДлительностьИсполненияПроцесса(
				СхемаКомплексногоПроцесса, Смещение);
		Иначе
			СрокиИсполненияПроцессовКОРП.ЗаполнитьСрокиИсполненияЭтаповКомплексногоПроцесса(Объект.Этапы);
			ДлительностьИсполнения = СрокиИсполненияПроцессов.ДлительностьИсполненияПроцесса(
				Объект, Смещение);
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(ЭтаФорма, ДлительностьИсполнения);
		
	КонецЕсли;
	
	Если РассчитьтатьТочныйСрок Тогда
		
		ПараметрыДляРасчетаСроков = СрокиИсполненияПроцессов.ПараметрыДляРасчетаСроков();
		ПараметрыДляРасчетаСроков.ДатаОтсчета = ДатаОтсчетаДляРасчетаСроков;
		ПараметрыДляРасчетаСроков.Смещение = Смещение;
		
		Если ИспользоватьСхемуПроцесса Тогда
			СрокиИсполненияПроцессовКОРП.РассчитатьСрокиКомплексногоПроцессаВКарточке(
				Объект, СхемаКомплексногоПроцесса, ПараметрыДляРасчетаСроков,, ПроцессыСхемыДляПрерывания);
		Иначе
			СрокиИсполненияПроцессовКОРП.РассчитатьСрокиКомплексногоПроцессаВКарточке(
				Объект,, ПараметрыДляРасчетаСроков, ИдентификаторыИзмененныхДействий.ВыгрузитьЗначения());
		КонецЕсли;
		
	КонецЕсли;
	
	Если Не РассчитатьОтносительныйСрок И Не РассчитьтатьТочныйСрок Тогда
		Если ИспользоватьСхемуПроцесса Тогда
			СрокиИсполненияПроцессовКлиентСерверКОРП.
				ЗаполнитьСрокиВПараметрахДействийСхемыКомплексногоПроцесса(
					СхемаКомплексногоПроцесса.ПараметрыДействий,
					СхемаКомплексногоПроцесса.ЭлементыСхемы,
					КэшДанныхДействий);
		Иначе
			СрокиИсполненияПроцессовКОРП.ЗаполнитьСрокиИсполненияЭтаповКомплексногоПроцесса(Объект.Этапы);
		КонецЕсли;
	КонецЕсли;
	
	РеквизитСИзмененнымСроком = "";
	ИдентификаторыИзмененныхДействий.Очистить();
	
	СрокиИсполненияПроцессовКлиентСерверКОРП.
		ЗаполнитьПредставлениеСроковИсполненияВФормеКомплексногоПроцесса(ЭтаФорма);
	
	ОбновитьПризнакиИстекшихСроков();
	
КонецПроцедуры

// Рассчитывает точные сроки комплексного процесса по данным схемы в карточке процесса/шаблона.
// Рассчитанный результата сохраняет во временном хранилище.
//
&НаСервере
Функция РассчитатьТочныеСрокиПоСхемеНаСервере()
	
	Возврат СрокиИсполненияПроцессовКОРП.РассчитатьТочныеСрокиКомплексногоПроцессаПоСхеме(ЭтаФорма);
	
КонецФункции

// см. ОбновитьСрокиИсполненияНаСервере
&НаКлиенте
Процедура ОбновитьСрокиИсполнения()
	
	ОбновитьСрокиИсполненияНаСервере();
	
КонецПроцедуры

// см. ОбновитьСрокиИсполнения
&НаКлиенте
Процедура ОбновитьСрокиИсполненияОтложенно()
	
	ПодключитьОбработчикОжидания("ОбновитьСрокиИсполнения", 0.2, Истина);
	
КонецПроцедуры

// Обновляет форму процесса после переноса сроков действий
//
&НаКлиенте
Процедура ОбновитьФормуПослеПереносаСроковИсполнения() Экспорт
	
	ОбновитьФормуПослеПереносаСроковИсполненияНаСервере();
	
	// Обновляем свойство ТолькоПросмотр 2 раза (вначале на противоположное, потом обратно),
	// т.к. иногда платформа не обновляет его.
	Элементы.Схема.ТолькоПросмотр = Не Элементы.Схема.ТолькоПросмотр;
	Элементы.Схема.ТолькоПросмотр = Не Элементы.Схема.ТолькоПросмотр;
	
КонецПроцедуры

// Обновляет форму процесса после переноса сроков действий на сервере.
//
&НаСервере
Процедура ОбновитьФормуПослеПереносаСроковИсполненияНаСервере() Экспорт
	
	Прочитать();
	Если Не ИспользоватьСхемуПроцесса Тогда
		РаботаСКомплекснымиБизнесПроцессамиСервер.ЗаполнитьВычисляемыеПоляЭтапов(ЭтаФорма);
	КонецЕсли;
	ОбновитьСрокиИсполненияНаСервере();
	
КонецПроцедуры

// Очищает дату расчета сроков.
//
// Параметры:
//  Форма - УправляемаяФорма - карточка текущего шаблона.
//
&НаКлиентеНаСервереБезКонтекста
Процедура ОчиститьДатуОтсчетаДляРасчетаСроков(Форма)
	
	Если ЗначениеЗаполнено(Форма.Объект.Шаблон) И Не Форма.Объект.Стартован Тогда
		Форма.ДатаОтсчетаДляРасчетаСроков = Дата(1,1,1);
	КонецЕсли;
	
КонецПроцедуры

// Возвращает необходимость расчета относительного срока.
//
// Параметры:
//  УправляемаяФорма - текущая форма.
//
&НаКлиентеНаСервереБезКонтекста
Функция РассчитыватьОтносительныйСрок(Форма)
	
	Если Не Форма.Объект.Стартован
		И Не Форма.Объект.ПометкаУдаления
		И ЗначениеЗаполнено(Форма.Объект.Шаблон)
		И Не ЗначениеЗаполнено(Форма.Объект.ВедущаяЗадача) Тогда
		
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

// Устанавливает условное оформление истекших сроков.
//
&НаСервере
Процедура УстановитьУсловноеОформлениеИстекшихСроков()
	
	СрокиИсполненияПроцессов.УстановитьУсловноеОформлениеИстекшегоСрока(
		ЭтаФорма,
		НСтр("ru = 'Срок исполнения действия истек (Этапы)'"),
		"Объект.Этапы.СрокИсполненияПроцессаИстек",
		"СрокИсполненияЭтапаПредставление");
	
	СрокиИсполненияПроцессов.УстановитьУсловноеОформлениеИстекшегоСрока(
		ЭтаФорма,
		НСтр("ru = 'Срок исполнения процесса истек'"),
		"СрокИсполненияПроцессаИстек",
		"СрокИсполненияПроцессаПредставление");
	
КонецПроцедуры

// Обновляет признаки истекших сроков в карточке.
//
&НаСервере
Процедура ОбновитьПризнакиИстекшихСроков()
	
	Если ИспользоватьСхемуПроцесса Тогда
		
		// Для схемы обновляем признак истекшего срока процесса.
		// Остальное выполняется при обновлении описания элементов в схеме.
		
		Если ЗначениеЗаполнено(ДатаОтсчетаДляРасчетаСроков) Тогда
		
			СрокиИсполненияПроцессов.ОбновитьПризнакИстекшегоСрокаПроцесса(
				Объект.СрокИсполненияПроцесса, Объект.ДатаЗавершения, СрокИсполненияПроцессаИстек);
			
		Иначе
			СрокИсполненияПроцессаИстек = Ложь;
		КонецЕсли;
		
	Иначе
		
		Если ЗначениеЗаполнено(ДатаОтсчетаДляРасчетаСроков) Тогда
			
			ТекущаяДатаСеанса = ТекущаяДатаСеанса();
			
			Для Каждого Этап Из Объект.Этапы Цикл
				
				Этап.СрокИсполненияПроцессаИстек = Ложь;
				
				Если Не ЗначениеЗаполнено(Этап.СрокИсполненияПроцесса) Тогда
					Продолжить;
				КонецЕсли;
				
				ДатаЗавершенияЭтапа = ТекущаяДатаСеанса;
				
				Отбор = Новый Структура;
				Отбор.Вставить("Действие", Этап.ЗапущенныйБизнесПроцесс);
				
				НайденныеДатыЗавершения = ДатыЗавершенияЭтапов.НайтиСтроки(Отбор);
				Если НайденныеДатыЗавершения.Количество() <> 0
					И ЗначениеЗаполнено(НайденныеДатыЗавершения[0].ДатаЗавершения) Тогда
					
					ДатаЗавершенияЭтапа = НайденныеДатыЗавершения[0].ДатаЗавершения;
				КонецЕсли;
				
				Если Этап.СрокИсполненияПроцесса < ДатаЗавершенияЭтапа Тогда
					Этап.СрокИсполненияПроцессаИстек = Истина;
				КонецЕсли;
				
			КонецЦикла;
			
			СрокиИсполненияПроцессов.ОбновитьПризнакИстекшегоСрокаПроцесса(
				Объект.СрокИсполненияПроцесса, Объект.ДатаЗавершения, СрокИсполненияПроцессаИстек);
		Иначе
			Для Каждого Этап Из Объект.Этапы Цикл
				Этап.СрокИсполненияПроцессаИстек = Ложь;
			КонецЦикла;
			СрокИсполненияПроцессаИстек = Ложь;
		КонецЕсли;
	
	КонецЕсли;
	
КонецПроцедуры

// Заполняет таблицу дат завершения этапов (ДатыЗавершенияЭтапов).
//
&НаСервере
Процедура ЗаполнитьДатыЗавершенияЭтапов()
	
	Если ИспользоватьСхемуПроцесса Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	ДатыЗавершенияЭтапов.Очистить();
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Возврат;
	КонецЕсли;
	
	ДействияИДатыЗавершения = 
		СрокиИсполненияПроцессовКОРП.ДатыЗавершенияДействийКомплексногоПроцесса(Объект.Ссылка);
	
	Для Каждого ДействиеИДатаЗавершения Из ДействияИДатыЗавершения Цикл
		СтрокаТаблицы = ДатыЗавершенияЭтапов.Добавить();
		СтрокаТаблицы.Действие = ДействиеИДатаЗавершения.Ключ;
		СтрокаТаблицы.ДатаЗавершения = ДействиеИДатаЗавершения.Значение;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции_ФоновыйИОтложенныйСтарт

&НаСервере
Процедура ОбновитьФормуПослеИзмененияНастроекОтложенногоСтарта() Экспорт
	
	ОбновитьДоступностьЭлементовФормыПоСостояниюПроцесса();
	
	РеквизитСИзмененнымСроком = "Этапы";
	ИдентификаторыИзмененныхДействий.Добавить(УникальныйИдентификаторПустой());
	ОчиститьДатуОтсчетаДляРасчетаСроков(ЭтаФорма);
	ОбновитьСрокиИсполненияНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьЗаполнениеПроцессаДляФоновогоСтарта(Отказ, ПараметрыЗаписи) Экспорт
	
	ПроверитьЗаполнениеПроцессаПередСтартом(Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДатаОтсчетаДляРасчетаСроков) Тогда
		СрокиИсполненияПроцессовКлиент.ПроверитьКорректностьЗаполненияСроковПередСтартом(
			ЭтаФорма, Объект, ПараметрыЗаписи, Отказ);
		Если Отказ Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти