#Область ПрограммныйИнтерфейс

// Возвращает шаблон структуры параметров для получения списка выбора уровня доступа.
// Параметрам необходимо задать требуемые значения и передать
// в метод НастройкиДоступаКлиентСерверПовтИсп.СписокВыбораУровняДоступа().
// 
Функция СтруктураПараметровДляПолученияСпискаВыбораУровняДоступа() Экспорт
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("МинимальныйПриоритет", 0);
	СтруктураПараметров.Вставить("ЕстьУнаследованныйДоступ", Ложь);
	СтруктураПараметров.Вставить("ВидДоступа", Неопределено);
	СтруктураПараметров.Вставить("ПредметДоступа", Неопределено);
	
	Возврат СтруктураПараметров;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
#КонецОбласти