
////////////////////////////////////////////////////////////////////////////////
// Обзор процессов клиент: содержит клиентские переопределяемые процедуры и функции по формированию
//                                HTML-обзора процессов и их шаблонов.
//  
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Обработчик нажатия поля ПредставлениеHTML
//
Функция ПредставлениеHTMLПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка, Форма) Экспорт
	
	Возврат Ложь;
	
КонецФункции

// Обработчик нажатия поля ПредставлениеHTML
//
Функция ПредставлениеПроцессаHTMLПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка, Форма) Экспорт
	
	Возврат Ложь;
	
КонецФункции

#КонецОбласти
