
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗначениеВРеквизитФормы(
		ПолучитьИзВременногоХранилища(Параметры.АдресТаблицыБесправныхПользователей),
		"ПользователиБезПрав");
	
КонецПроцедуры

&НаКлиенте
Процедура Повторить(Команда)
	
	Закрыть("Повторить");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьВсеРавно(Команда)
	
	Закрыть("ЗаписатьБезПроверки");
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ПользователиБезПравВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ИмяТекущейКолонки = Элементы.ПользователиБезПрав.ТекущийЭлемент.Имя;
	Если ИмяТекущейКолонки = "ПользователиБезПравПапкаРодитель" Тогда
		ПапкаРодитель = Элементы.ПользователиБезПрав.ТекущиеДанные.ПапкаРодитель;
		ПараметрыФормы = Новый Структура("СсылкаНаОбъект", ПапкаРодитель);
		ОткрытьФорму("ОбщаяФорма.НастройкиПравПапок", ПараметрыФормы, , ПапкаРодитель);
	ИначеЕсли ИмяТекущейКолонки = "ПользователиБезПравПользовательПредставление" Тогда
		ПоказатьЗначение(,Элементы.ПользователиБезПрав.ТекущиеДанные.Пользователь);
	КонецЕсли;
	
КонецПроцедуры
