
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр РеализацииПоПроектам 
	Движения.РеализацииПоПроектам.Записывать = Истина;
	Для Каждого ТекСтрокаПроекты Из Проекты Цикл
		Движение = Движения.РеализацииПоПроектам.Добавить();
		Движение.Период = Период;
		Движение.Сценарий = Сценарий;
		Движение.Подразделение = Подразделение;
		Движение.Статья = ТекСтрокаПроекты.Статья;
		Движение.Проект = ТекСтрокаПроекты.Проект;
		Движение.Сумма = ТекСтрокаПроекты.Сумма;
		Движение.ПроектнаяЗадача = ТекСтрокаПроекты.ПроектнаяЗадача;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Ответственный = Пользователи.АвторизованныйПользователь();
КонецПроцедуры
